-------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lizzieriese/Desktop/S21/ECO375/ECO375_A2.log
  log type:  text
 opened on:  14 Apr 2021, 15:08:35

. use "/Users/lizzieriese/Desktop/S21/ECO375/Assignment 2/daAssignm
> ent2.dta"

. reg fhpolrigaug L1.lrgdpch, vce(robust)

Linear regression                               Number of obs     =
>       1,023
                                                F(1, 1021)        =
>      955.24
                                                Prob > F          =
>      0.0000
                                                R-squared         =
>      0.4034
                                                Root MSE          =
>      .27869

-------------------------------------------------------------------
> -----------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf
> . Interval]
-------------+-----------------------------------------------------
> -----------
     lrgdpch |
         L1. |   .2254815   .0072955    30.91   0.000     .2111657 
>    .2397974
             |
       _cons |  -1.257608   .0624196   -20.15   0.000    -1.380094 
>   -1.135123
-------------------------------------------------------------------
> -----------

. xtset code_numeric year_numeric
       panel variable:  code_numeric (strongly balanced)
        time variable:  year_numeric, 31 to 41
                delta:  1 unit

. reg fhpolrigaug L1.lrgdpch, vce(robust)

Linear regression                               Number of obs     =
>       1,023
                                                F(1, 1021)        =
>      955.24
                                                Prob > F          =
>      0.0000
                                                R-squared         =
>      0.4034
                                                Root MSE          =
>      .27869

-------------------------------------------------------------------
> -----------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf
> . Interval]
-------------+-----------------------------------------------------
> -----------
     lrgdpch |
         L1. |   .2254815   .0072955    30.91   0.000     .2111657 
>    .2397974
             |
       _cons |  -1.257608   .0624196   -20.15   0.000    -1.380094 
>   -1.135123
-------------------------------------------------------------------
> -----------

. reg fhpolrigaug L1.lrgdpch, robust

Linear regression                               Number of obs     =
>       1,023
                                                F(1, 1021)        =
>      955.24
                                                Prob > F          =
>      0.0000
                                                R-squared         =
>      0.4034
                                                Root MSE          =
>      .27869

-------------------------------------------------------------------
> -----------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf
> . Interval]
-------------+-----------------------------------------------------
> -----------
     lrgdpch |
         L1. |   .2254815   .0072955    30.91   0.000     .2111657 
>    .2397974
             |
       _cons |  -1.257608   .0624196   -20.15   0.000    -1.380094 
>   -1.135123
-------------------------------------------------------------------
> -----------

. reg fhpolrigaug L1.lrgdpch i.country ,robust cluster(country)
country:  string variables may not be used as factor variables
r(109);

. reg fhpolrigaug L1.lrgdpch code_numeric ,robust cluster(code_nume
> ric)

Linear regression                               Number of obs     =
>       1,023
                                                F(2, 146)         =
>      165.00
                                                Prob > F          =
>      0.0000
                                                R-squared         =
>      0.4039
                                                Root MSE          =
>      .27871

                         (Std. Err. adjusted for 147 clusters in co
> de_numeric)
-------------------------------------------------------------------
> -----------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf
> . Interval]
-------------+-----------------------------------------------------
> -----------
     lrgdpch |
         L1. |   .2244465   .0128538    17.46   0.000     .1990429 
>      .24985
             |
code_numeric |  -.0001437   .0002709    -0.53   0.597     -.000679 
>    .0003917
       _cons |  -1.234571   .1200035   -10.29   0.000    -1.471739 
>   -.9974024
-------------------------------------------------------------------
> -----------

. reg fhpolrigaug L1.lrgdpch i.code_numeric ,robust cluster(code_numeric)

Linear regression                               Number of obs     =      1,023
                                                F(0, 146)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7272
                                                Root MSE          =     .20358

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0550704   .0329488     1.67   0.097    -.0100479    .1201887
             |
code_numeric |
          4  |   .3935822   .0106775    36.86   0.000     .3724798    .4146847
          6  |   .4632062   .0464018     9.98   0.000     .3715001    .5549123
          7  |   .4052545   .0036939   109.71   0.000      .397954     .412555
          8  |   .4446813   .0548927     8.10   0.000     .3361943    .5531683
          9  |   .8038436   .0643685    12.49   0.000     .6766293    .9310579
         10  |   .8065569   .0587564    13.73   0.000     .6904339    .9226799
         11  |   .0747733   .0019875    37.62   0.000     .0708453    .0787014
         14  |   .0835655   .0346838     2.41   0.017     .0150183    .1521127
         15  |   .8138235   .0583974    13.94   0.000       .69841     .929237
         16  |   .2080785   .0216785     9.60   0.000     .1652343    .2509227
         18  |   .4437532     .01934    22.94   0.000     .4055308    .4819756
         19  |   .6789362   .0393837    17.24   0.000     .6011003    .7567721
         23  |   .0933152   .0407525     2.29   0.023     .0127743    .1738562
         24  |    .860231   .0306317    28.08   0.000     .7996922    .9207698
         25  |   .4343567   .0084193    51.59   0.000     .4177173     .450996
         26  |   .5512437   .0206524    26.69   0.000     .5104274    .5920599
         27  |   .8374028   .0442899    18.91   0.000     .7498707    .9249349
         30  |   .7285937   .0096735    75.32   0.000     .7094756    .7477118
         31  |   .1504394   .0053912    27.90   0.000     .1397845    .1610943
         32  |   .8019425   .0655059    12.24   0.000     .6724801    .9314048
         33  |   .7889159   .0727015    10.85   0.000     .6452327    .9325991
         34  |   .5083582   .0286499    17.74   0.000     .4517362    .5649802
         35  |    .027271   .0212231     1.28   0.201    -.0146731    .0692152
         36  |   .1055719    .001759    60.02   0.000     .1020955    .1090483
         37  |   .0880768   .0014847    59.32   0.000     .0851425    .0910111
         38  |   .1424978   .0165945     8.59   0.000     .1097014    .1752943
         39  |   .5924193   .0186859    31.70   0.000     .5554895    .6293491
         40  |   .2424696   .0013715   176.80   0.000     .2397591    .2451801
         41  |   .4113215   .0000641  6420.06   0.000     .4111949    .4114481
         42  |   .8439473   .0230235    36.66   0.000      .798445    .8894496
         43  |   -.149315   .0363431    -4.11   0.000    -.2211416   -.0774885
         44  |   .7096736   .0362834    19.56   0.000     .6379651    .7813822
         45  |   .8085696   .0615409    13.14   0.000     .6869436    .9301956
         47  |   .7880868   .0737958    10.68   0.000     .6422408    .9339328
         51  |   .7789584   .0293987    26.50   0.000     .7208564    .8370605
         52  |   .8018273   .0655748    12.23   0.000     .6722288    .9314258
         53  |   .5446278   .0045121   120.70   0.000     .5357104    .5535453
         54  |   .0748076   .0221597     3.38   0.001     .0310123    .1186029
         56  |   .2000203   .0001546  1293.87   0.000     .1997148    .2003258
         58  |   .4169165   .0451791     9.23   0.000      .327627    .5062061
         59  |   .8398553   .0428225    19.61   0.000     .7552233    .9244874
         60  |   .3193336   .0446165     7.16   0.000     .2311559    .4075114
         61  |   .1097482   .0428703     2.56   0.011     .0250218    .1944747
         63  |   .7442148   .0565679    13.16   0.000     .6324171    .8560124
         64  |   .4686716   .0227326    20.62   0.000     .4237442     .513599
         65  |   .7950075   .0576891    13.78   0.000      .680994     .909021
         66  |   .1307816   .0395261     3.31   0.001     .0526644    .2088988
         67  |   .8100113   .0594817    13.62   0.000     .6924549    .9275677
         70  |   .3142613   .0209735    14.98   0.000     .2728104    .3557122
         71  |   .0087396    .006844     1.28   0.204    -.0047865    .0222657
         72  |   .5125384   .0177584    28.86   0.000     .4774416    .5476351
         73  |   .2902541   .0438377     6.62   0.000     .2036157    .3768925
         74  |  -.0466654   .0034181   -13.65   0.000    -.0534208     -.03991
         75  |   .6553981   .0452677    14.48   0.000     .5659336    .7448627
         76  |    .791011   .0221876    35.65   0.000     .7471606    .8348614
         77  |   .4507961   .0123445    36.52   0.000     .4263992     .475193
         79  |   .4171809   .0018462   225.97   0.000     .4135322    .4208297
         80  |   .6779233   .0399898    16.95   0.000     .5988896    .7569569
         81  |   .1716372   .0227274     7.55   0.000       .12672    .2165545
         82  |   .4207753   .0442665     9.51   0.000     .3332894    .5082611
         83  |   .2062296   .0068612    30.06   0.000     .1926695    .2197897
         84  |   .7784804   .0203734    38.21   0.000     .7382156    .8187452
         85  |   .8285853    .044779    18.50   0.000     .7400865    .9170841
         86  |   .1521898   .0199312     7.64   0.000     .1127988    .1915807
         88  |   .8113919   .0598523    13.56   0.000      .693103    .9296807
         89  |   .7411446   .0472364    15.69   0.000     .6477892    .8345001
         90  |   .8139238   .0541493    15.03   0.000      .706906    .9209416
         91  |   .7712216    .015857    48.64   0.000     .7398827    .8025605
         92  |   .2051457   .0101853    20.14   0.000     .1850161    .2252753
         93  |   .7928252   .0498208    15.91   0.000     .6943622    .8912882
         94  |   .0211898   .0340468     0.62   0.535    -.0460984    .0884779
         95  |   .2607524   .0235276    11.08   0.000     .2142537     .307251
         96  |   .0662161   .0071073     9.32   0.000     .0521696    .0802627
         97  |   .1082251   .0180268     6.00   0.000     .0725979    .1438523
         99  |   .8416787   .0417316    20.17   0.000     .7592027    .9241547
        101  |   .4384208   .0204134    21.48   0.000     .3980768    .4787648
        104  |   .0423752   .0213714     1.98   0.049     .0001379    .0846125
        107  |   .8683337   .0257838    33.68   0.000     .8173759    .9192914
        109  |   .6839048   .0054702   125.02   0.000     .6730937    .6947158
        110  |   .2527058   .0189982    13.30   0.000     .2151588    .2902529
        111  |   .8500733   .0367091    23.16   0.000     .7775235    .9226231
        112  |   .7618229   .0683695    11.14   0.000      .626701    .8969447
        113  |   .7550403    .043709    17.27   0.000     .6686562    .8414244
        114  |   .2996606   .0046033    65.10   0.000      .290563    .3087583
        115  |   .7364527   .0049714   148.14   0.000     .7266275    .7462779
        116  |   .4679491   .0216011    21.66   0.000     .4252579    .5106404
        118  |   .4523102   .0342627    13.20   0.000     .3845952    .5200252
        119  |   .3677691   .0261216    14.08   0.000     .3161438    .4193944
        120  |   .2357425   .0292554     8.06   0.000     .1779237    .2935614
        121  |   .8118441   .0595817    13.63   0.000       .69409    .9295982
        125  |   .2217681   .0187221    11.85   0.000     .1847668    .2587694
        126  |   .0850476   .0098934     8.60   0.000     .0654949    .1046003
        127  |     .70823   .0361025    19.62   0.000     .6368791     .779581
        128  |   .2844456   .0426892     6.66   0.000      .200077    .3688141
        129  |   .5041008    .020339    24.78   0.000     .4639039    .5442977
        130  |   .7036085   .0246222    28.58   0.000     .6549464    .7522705
        131  |   .1488423   .0178975     8.32   0.000     .1134707    .1842139
        132  |   .3221413   .0223642    14.40   0.000     .2779419    .3663407
        133  |   .3826567   .0114307    33.48   0.000     .3600657    .4052477
        134  |   .8100722   .0606418    13.36   0.000      .690223    .9299215
        135  |   .8113335   .0598872    13.55   0.000     .6929757    .9296914
        136  |   .4292966    .026396    16.26   0.000      .377129    .4814641
        137  |   .8074728   .0621971    12.98   0.000     .6845499    .9303958
        140  |   .2984564   .0121822    24.50   0.000     .2743802    .3225326
        141  |   .4875209   .0365518    13.34   0.000      .415282    .5597599
        142  |   .4047073    .018979    21.32   0.000     .3671983    .4422163
        144  |   .4726865   .0213846    22.10   0.000      .430423    .5149499
        145  |   .5792669   .0048831   118.63   0.000     .5696162    .5889177
        147  |    .692945   .0143827    48.18   0.000     .6645198    .7213701
        148  |   .5950134   .0397364    14.97   0.000     .5164805    .6735463
        150  |   .5271364   .0354747    14.86   0.000      .457026    .5972467
        151  |   .3089288   .0174504    17.70   0.000     .2744408    .3434168
        153  |   .1100758   .0090361    12.18   0.000     .0922174    .1279341
        154  |   .1756543   .0413473     4.25   0.000     .0939378    .2573709
        155  |   .0557981   .0265464     2.10   0.037     .0033331    .1082631
        160  |   .3793103   .0092742    40.90   0.000     .3609813    .3976394
        162  |   .2656349   .0450983     5.89   0.000     .1765051    .3547647
        165  |   .2247082   .0164925    13.62   0.000     .1921134     .257303
        166  |   .5421654   .0195026    27.80   0.000     .5036214    .5807093
        168  |    .443223   .0190228    23.30   0.000     .4056275    .4808186
        170  |   .7372904   .0543288    13.57   0.000     .6299179     .844663
        171  |   .8100593   .0606496    13.36   0.000     .6901948    .9299238
        172  |   .7832201   .0656279    11.93   0.000     .6535167    .9129235
        174  |   .2068193   .0426447     4.85   0.000     .1225387    .2910999
        175  |   .0096634   .0060419     1.60   0.112    -.0022775    .0216044
        176  |   .0877587   .0197421     4.45   0.000     .0487415    .1267759
        177  |    .103597   .0189972     5.45   0.000      .066052     .141142
        178  |   .4510927    .000201  2244.60   0.000     .4506955    .4514898
        182  |   .7484416   .0392365    19.08   0.000     .6708968    .8259864
        183  |   .0915573   .0204363     4.48   0.000     .0511681    .1319464
        184  |    .506396   .0189658    26.70   0.000      .468913    .5438789
        186  |   .3115745   .0270856    11.50   0.000      .258044    .3651051
        187  |   .2739401   .0451289     6.07   0.000     .1847497    .3631305
        188  |    .288566    .039947     7.22   0.000      .209617     .367515
        189  |   .4275877   .0401906    10.64   0.000     .3481572    .5070181
        191  |   .6475857   .0381974    16.95   0.000     .5720945     .723077
        192  |   .7784624   .0705796    11.03   0.000     .6389728     .917952
        194  |  -.1005631   .0071746   -14.02   0.000    -.1147426   -.0863835
        195  |   .7415834    .026831    27.64   0.000      .688556    .7946107
        196  |   .6160727   .0438891    14.04   0.000     .5293328    .7028127
        197  |  -.0655592   .0137683    -4.76   0.000    -.0927701   -.0383483
        203  |   .2852026   .0241958    11.79   0.000     .2373833    .3330219
        208  |   .4707366     .03711    12.68   0.000     .3973945    .5440787
        209  |   .1013206   .0329529     3.07   0.003     .0361943     .166447
        210  |   .3383085    .018326    18.46   0.000       .30209    .3745271
        211  |    .212574   .0050128    42.41   0.000     .2026669    .2224811
             |
       _cons |  -.3312585   .2511857    -1.32   0.189    -.8276884    .1651714
------------------------------------------------------------------------------

. reg fhpolrigaug L1.lrgdpch,robust cluster(code_numeric)

Linear regression                               Number of obs     =      1,023
                                                F(1, 146)         =     326.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4034
                                                Root MSE          =     .27869

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .2254815   .0124841    18.06   0.000     .2008087    .2501544
             |
       _cons |  -1.257608   .1060415   -11.86   0.000    -1.467183   -1.048034
------------------------------------------------------------------------------

. reg fhpolrigaug L1.lrgdpch i.code_numeric i.code_year ,robust cluster(code_numeric code_year)
variable code_year not found
r(111);

. reg fhpolrigaug L1.lrgdpch i.code_numeric i.year_numeric ,robust cluster(code_numeric year_numeric)
too many variables specified
option cluster() incorrectly specified
r(198);

. reg fhpolrigaug L1.lrgdpch i.code_numeric i.year_numeric ,robust cluster(code_numeric, year_numeric)
, is invalid variable name
option cluster() incorrectly specified
r(198);

. xtreg fhpolrigaug L1.lrgdpch ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.0101                                         min =          1
     between = 0.5137                                         avg =        7.0
     overall = 0.4034                                         max =         10

                                                F(1,146)          =       3.26
corr(u_i, Xb)  = 0.6448                         Prob > F          =     0.0731

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0550704   .0305022     1.81   0.073    -.0052125    .1153533
             |
       _cons |   .1310691   .2485619     0.53   0.599    -.3601752    .6223134
-------------+----------------------------------------------------------------
     sigma_u |  .28130249
     sigma_e |  .20357801
         rho |  .65628054   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. reg fhpolrigaug L1.lrgdpch, cluster(code_numeric)

Linear regression                               Number of obs     =      1,023
                                                F(1, 146)         =     326.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4034
                                                Root MSE          =     .27869

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .2254815   .0124841    18.06   0.000     .2008087    .2501544
             |
       _cons |  -1.257608   .1060415   -11.86   0.000    -1.467183   -1.048034
------------------------------------------------------------------------------

. reg fhpolrigaug L1.lrgdpch,robust cluster(code_numeric)

Linear regression                               Number of obs     =      1,023
                                                F(1, 146)         =     326.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4034
                                                Root MSE          =     .27869

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .2254815   .0124841    18.06   0.000     .2008087    .2501544
             |
       _cons |  -1.257608   .1060415   -11.86   0.000    -1.467183   -1.048034
------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.0101                                         min =          1
     between = 0.5137                                         avg =        7.0
     overall = 0.4034                                         max =         10

                                                F(1,146)          =       3.26
corr(u_i, Xb)  = 0.6448                         Prob > F          =     0.0731

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0550704   .0305022     1.81   0.073    -.0052125    .1153533
             |
       _cons |   .1310691   .2485619     0.53   0.599    -.3601752    .6223134
-------------+----------------------------------------------------------------
     sigma_u |  .28130249
     sigma_e |  .20357801
         rho |  .65628054   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. reg fhpolrigaug L1.lrgdpch, robust

Linear regression                               Number of obs     =      1,023
                                                F(1, 1021)        =     955.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4034
                                                Root MSE          =     .27869

------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .2254815   .0072955    30.91   0.000     .2111657    .2397974
             |
       _cons |  -1.257608   .0624196   -20.15   0.000    -1.380094   -1.135123
------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1184                                         min =          1
     between = 0.4088                                         avg =        7.0
     overall = 0.3334                                         max =         10

                                                F(10,146)         =       6.35
corr(u_i, Xb)  = 0.4496                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0587276   .0420195     1.40   0.164    -.0243175    .1417728
             |
year_numeric |
         33  |   .0575566   .0275762     2.09   0.039     .0030564    .1120568
         34  |    .052962   .0296839     1.78   0.076    -.0057036    .1116276
         35  |   -.099374   .0370808    -2.68   0.008    -.1726584   -.0260896
         36  |  -.1261975   .0419239    -3.01   0.003    -.2090537   -.0433414
         37  |  -.0806147   .0410727    -1.96   0.052    -.1617885     .000559
         38  |   -.061898   .0479339    -1.29   0.199     -.156632    .0328359
         39  |  -.0222524   .0462655    -0.48   0.631    -.1136889    .0691841
         40  |    .025015   .0521551     0.48   0.632    -.0780615    .1280916
         41  |   .0467897   .0518172     0.90   0.368    -.0556189    .1491984
             |
       _cons |   .1244808   .3202462     0.39   0.698    -.5084364    .7573981
-------------+----------------------------------------------------------------
     sigma_u |   .2781524
     sigma_e |  .19311355
         rho |  .67475736   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education age_veryyoung age_young age_old age_ver
> yold i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1420                                         min =          1
     between = 0.0159                                         avg =        7.3
     overall = 0.0303                                         max =          8

                                                F(14,93)          =       4.15
corr(u_i, Xb)  = -0.4287                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0149082   .0484161     0.31   0.759    -.0812365    .1110529
              |
         lpop |
          L1. |  -.1142962    .108373    -1.05   0.294    -.3295034     .100911
              |
    education |
          L1. |  -.0042739   .0220287    -0.19   0.847    -.0480186    .0394707
              |
age_veryyoung |   2.286866   .7260133     3.15   0.002     .8451478    3.728585
    age_young |   3.062996   .9069984     3.38   0.001     1.261877    4.864116
      age_old |   1.959668   1.197758     1.64   0.105    -.4188414    4.338178
  age_veryold |   4.116161   1.752809     2.35   0.021     .6354302    7.596892
              |
 year_numeric |
          35  |  -.1306626   .0333535    -3.92   0.000    -.1968961   -.0644291
          36  |  -.1601387   .0428816    -3.73   0.000    -.2452932   -.0749843
          37  |   -.077641    .052487    -1.48   0.142    -.1818699    .0265878
          38  |  -.0174229   .0675738    -0.26   0.797     -.151611    .1167653
          39  |   .0424316   .0789044     0.54   0.592    -.1142568    .1991201
          40  |   .0997246   .0921391     1.08   0.282    -.0832455    .2826947
          41  |   .1393293   .1054218     1.32   0.190    -.0700175    .3486761
              |
        _cons |  -.6629826   1.333109    -0.50   0.620    -3.310272    1.984307
--------------+----------------------------------------------------------------
      sigma_u |  .33774322
      sigma_e |   .1965643
          rho |   .7469843   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. gen demo_sample=(e(sample)==1)

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1184                                         min =          1
     between = 0.4088                                         avg =        7.0
     overall = 0.3334                                         max =         10

                                                F(10,146)         =       6.35
corr(u_i, Xb)  = 0.4496                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0587276   .0420195     1.40   0.164    -.0243175    .1417728
             |
year_numeric |
         33  |   .0575566   .0275762     2.09   0.039     .0030564    .1120568
         34  |    .052962   .0296839     1.78   0.076    -.0057036    .1116276
         35  |   -.099374   .0370808    -2.68   0.008    -.1726584   -.0260896
         36  |  -.1261975   .0419239    -3.01   0.003    -.2090537   -.0433414
         37  |  -.0806147   .0410727    -1.96   0.052    -.1617885     .000559
         38  |   -.061898   .0479339    -1.29   0.199     -.156632    .0328359
         39  |  -.0222524   .0462655    -0.48   0.631    -.1136889    .0691841
         40  |    .025015   .0521551     0.48   0.632    -.0780615    .1280916
         41  |   .0467897   .0518172     0.90   0.368    -.0556189    .1491984
             |
       _cons |   .1244808   .3202462     0.39   0.698    -.5084364    .7573981
-------------+----------------------------------------------------------------
     sigma_u |   .2781524
     sigma_e |  .19311355
         rho |  .67475736   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold 
> i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. gen demo_sample=(e(sample)==1)
variable demo_sample already defined
r(110);

. gen demo_sample_0=(e(sample)==1)

. demo_sample_0
command demo_sample_0 is unrecognized
r(199);

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric ,fe cluster(code_numeric) if demo_sample_0 ==1
option if not allowed
r(198);

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric ,fe cluster(code_numeric) if sample==1
option if not allowed
r(198);

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric if demo_sample_0==1 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1048                                         min =          1
     between = 0.5013                                         avg =        7.3
     overall = 0.0061                                         max =          8

                                                F(8,93)           =       5.22
corr(u_i, Xb)  = -0.3041                        Prob > F          =     0.0000

                          (Std. Err. adjusted for 94 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |  -.0228115   .0499336    -0.46   0.649    -.1219697    .0763467
             |
year_numeric |
         35  |  -.1119415   .0310247    -3.61   0.000    -.1735505   -.0503325
         36  |  -.1332268    .034168    -3.90   0.000    -.2010776    -.065376
         37  |  -.0619378   .0337506    -1.84   0.070    -.1289599    .0050843
         38  |  -.0205754   .0382114    -0.54   0.592    -.0964557    .0553048
         39  |   .0098789    .036306     0.27   0.786    -.0622176    .0819755
         40  |   .0409967   .0452398     0.91   0.367    -.0488405     .130834
         41  |   .0663302   .0485305     1.37   0.175    -.0300418    .1627022
             |
       _cons |   .8225487   .3967789     2.07   0.041     .0346243    1.610473
-------------+----------------------------------------------------------------
     sigma_u |  .32069427
     sigma_e |  .19973789
         rho |  .72050433   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric if sample==1 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        935
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1154                                         min =          1
     between = 0.3720                                         avg =        6.4
     overall = 0.3072                                         max =          9

                                                F(9,146)          =       5.63
corr(u_i, Xb)  = 0.4316                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0501503   .0426172     1.18   0.241    -.0340761    .1343767
             |
year_numeric |
         34  |   .0106123   .0197402     0.54   0.592    -.0284011    .0496257
         35  |  -.1212115   .0320448    -3.78   0.000     -.184543   -.0578799
         36  |  -.1374211     .03577    -3.84   0.000    -.2081149   -.0667273
         37  |  -.0935871   .0358704    -2.61   0.010    -.1644795   -.0226948
         38  |  -.0791951   .0392662    -2.02   0.046    -.1567986   -.0015915
         39  |  -.0345992   .0353272    -0.98   0.329    -.1044179    .0352195
         40  |   .0130353   .0429236     0.30   0.762    -.0717965    .0978672
         41  |   .0366445   .0430716     0.85   0.396    -.0484798    .1217688
             |
       _cons |   .2038333   .3300115     0.62   0.538    -.4483834      .85605
-------------+----------------------------------------------------------------
     sigma_u |  .28802002
     sigma_e |  .19197739
         rho |  .69238749   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young 

Random-effects GLS regression                   Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.0305                                         min =          1
     between = 0.6741                                         avg =        7.3
     overall = 0.4820                                         max =          8

                                                Wald chi2(5)      =     201.94
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

-------------------------------------------------------------------------------
  fhpolrigaug |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0720744   .0278141     2.59   0.010     .0175598     .126589
              |
         lpop |
          L1. |   -.014805   .0109709    -1.35   0.177    -.0363076    .0066977
              |
    education |
          L1. |   .0413031     .00931     4.44   0.000     .0230558    .0595503
              |
age_veryyoung |
          L1. |  -.2759633   .2810697    -0.98   0.326    -.8268498    .2749232
              |
    age_young |
          L1. |  -1.164202   .4292846    -2.71   0.007    -2.005584   -.3228192
              |
        _cons |   .3590845   .3355362     1.07   0.285    -.2985543    1.016723
--------------+----------------------------------------------------------------
      sigma_u |  .14633985
      sigma_e |  .20596357
          rho |  .33547272   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. > L1.age_old L1.age_veryold i.year_numeric ,fe cluster(code_numeric)
> is not a valid command name
r(199);

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold 
> i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1184                                         min =          1
     between = 0.4088                                         avg =        7.0
     overall = 0.3334                                         max =         10

                                                F(10,146)         =       6.35
corr(u_i, Xb)  = 0.4496                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0587276   .0420195     1.40   0.164    -.0243175    .1417728
             |
year_numeric |
         33  |   .0575566   .0275762     2.09   0.039     .0030564    .1120568
         34  |    .052962   .0296839     1.78   0.076    -.0057036    .1116276
         35  |   -.099374   .0370808    -2.68   0.008    -.1726584   -.0260896
         36  |  -.1261975   .0419239    -3.01   0.003    -.2090537   -.0433414
         37  |  -.0806147   .0410727    -1.96   0.052    -.1617885     .000559
         38  |   -.061898   .0479339    -1.29   0.199     -.156632    .0328359
         39  |  -.0222524   .0462655    -0.48   0.631    -.1136889    .0691841
         40  |    .025015   .0521551     0.48   0.632    -.0780615    .1280916
         41  |   .0467897   .0518172     0.90   0.368    -.0556189    .1491984
             |
       _cons |   .1244808   .3202462     0.39   0.698    -.5084364    .7573981
-------------+----------------------------------------------------------------
     sigma_u |   .2781524
     sigma_e |  .19311355
         rho |  .67475736   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch ,cluster(code_numeric)

Random-effects GLS regression                   Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.0101                                         min =          1
     between = 0.5137                                         avg =        7.0
     overall = 0.4034                                         max =         10

                                                Wald chi2(1)      =      85.31
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .1459177   .0157978     9.24   0.000     .1149546    .1768807
             |
       _cons |  -.6197419   .1296113    -4.78   0.000    -.8737753   -.3657084
-------------+----------------------------------------------------------------
     sigma_u |  .19608751
     sigma_e |  .20357801
         rho |  .48126466   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.0101                                         min =          1
     between = 0.5137                                         avg =        7.0
     overall = 0.4034                                         max =         10

                                                F(1,146)          =       3.26
corr(u_i, Xb)  = 0.6448                         Prob > F          =     0.0731

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0550704   .0305022     1.81   0.073    -.0052125    .1153533
             |
       _cons |   .1310691   .2485619     0.53   0.599    -.3601752    .6223134
-------------+----------------------------------------------------------------
     sigma_u |  .28130249
     sigma_e |  .20357801
         rho |  .65628054   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1097                                         min =          1
     between = 0.0535                                         avg =        7.3
     overall = 0.0191                                         max =          8

                                                F(10,93)          =       4.15
corr(u_i, Xb)  = -0.6374                        Prob > F          =     0.0001

                          (Std. Err. adjusted for 94 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |  -.0331256   .0492959    -0.67   0.503    -.1310175    .0647663
             |
        lpop |
         L1. |  -.1128791   .1036475    -1.09   0.279    -.3187025    .0929443
             |
   education |
         L1. |  -.0121852   .0226506    -0.54   0.592    -.0571649    .0327945
             |
year_numeric |
         35  |  -.0981601   .0321752    -3.05   0.003    -.1620537   -.0342665
         36  |  -.1008887   .0408182    -2.47   0.015    -.1819457   -.0198318
         37  |  -.0141498   .0505285    -0.28   0.780    -.1144894    .0861897
         38  |   .0457386   .0669234     0.68   0.496    -.0871581    .1786352
         39  |   .0913782   .0760243     1.20   0.232    -.0595909    .2423474
         40  |   .1396363   .0911851     1.53   0.129    -.0414392    .3207118
         41  |   .1807651   .1032436     1.75   0.083    -.0242562    .3857863
             |
       _cons |   1.928452   1.071767     1.80   0.075    -.1998656    4.056769
-------------+----------------------------------------------------------------
     sigma_u |   .3932566
     sigma_e |  .19953337
         rho |  .79526545   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold,
> fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.0594                                         min =          1
     between = 0.1997                                         avg =        7.3
     overall = 0.1720                                         max =          8

                                                F(7,93)           =       2.58
corr(u_i, Xb)  = -0.3142                        Prob > F          =     0.0177

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.0517108   .0508261    -1.02   0.312    -.1526414    .0492197
              |
         lpop |
          L1. |   .0978068   .0789491     1.24   0.219    -.0589704    .2545841
              |
    education |
          L1. |   .0259349   .0195408     1.33   0.188    -.0128693    .0647391
              |
age_veryyoung |
          L1. |   .9723256   .7482438     1.30   0.197    -.5135383     2.45819
              |
    age_young |
          L1. |   .5252541   .8786438     0.60   0.551    -1.219558    2.270066
              |
      age_old |
          L1. |   1.958715   1.380346     1.42   0.159    -.7823793    4.699809
              |
  age_veryold |
          L1. |    3.33727   1.594572     2.09   0.039     .1707668    6.503774
              |
        _cons |  -.9791679   1.040132    -0.94   0.349    -3.044663    1.086327
--------------+----------------------------------------------------------------
      sigma_u |  .28401273
      sigma_e |  .20457039
          rho |  .65840938   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1184                                         min =          1
     between = 0.4088                                         avg =        7.0
     overall = 0.3334                                         max =         10

                                                F(10,146)         =       6.35
corr(u_i, Xb)  = 0.4496                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0587276   .0420195     1.40   0.164    -.0243175    .1417728
             |
year_numeric |
         33  |   .0575566   .0275762     2.09   0.039     .0030564    .1120568
         34  |    .052962   .0296839     1.78   0.076    -.0057036    .1116276
         35  |   -.099374   .0370808    -2.68   0.008    -.1726584   -.0260896
         36  |  -.1261975   .0419239    -3.01   0.003    -.2090537   -.0433414
         37  |  -.0806147   .0410727    -1.96   0.052    -.1617885     .000559
         38  |   -.061898   .0479339    -1.29   0.199     -.156632    .0328359
         39  |  -.0222524   .0462655    -0.48   0.631    -.1136889    .0691841
         40  |    .025015   .0521551     0.48   0.632    -.0780615    .1280916
         41  |   .0467897   .0518172     0.90   0.368    -.0556189    .1491984
             |
       _cons |   .1244808   .3202462     0.39   0.698    -.5084364    .7573981
-------------+----------------------------------------------------------------
     sigma_u |   .2781524
     sigma_e |  .19311355
         rho |  .67475736   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. summarize fhpolrigaug

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 fhpolrigaug |      1,194    .5683026    .3577456          0          1

. summarize L1.lrgdpch

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     lrgdpch |
         L1. |      1,073    8.119805    1.018874   5.773925   10.44502

. summarize year_numeric

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
year_numeric |      1,617          36    3.163256         31         41

. summarize L1.education

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   education |
         L1. |        722    4.458411    2.873866       .042     12.179

. summarize L1.lpop

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        lpop |
         L1. |      1,162    8.641282    1.901931   3.713572   14.00187

. summarize L1.age_veryyoung

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
age_veryyo~g |
         L1. |      1,410    .3676318    .0921898   .1495436    .516075

. summarize age_veryyoung

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
age_veryyo~g |      1,551    .3633937    .0947497   .1429192    .516075

. summarize lpop

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        lpop |      1,308    8.681876    1.907321   3.713572   14.04857

. summarize education

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   education |        722    4.458411    2.873866       .042     12.179

. summarize lrgdpch

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     lrgdpch |      1,199    8.165034     1.03723   5.773925    10.6917

. summarize age_young

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   age_young |      1,551    .2545971    .0256452   .1685487   .3465838

. summarize age_midage

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  age_midage |      1,551    .1753407    .0298319   .0896552   .2979275

. summarize age_veryold

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 age_veryold |      1,551    .0882882     .049307   .0316477    .240632

. summarize age_old

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     age_old |      1,551    .1183803    .0374434   .0560114   .2214919

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young 

Random-effects GLS regression                   Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.0305                                         min =          1
     between = 0.6741                                         avg =        7.3
     overall = 0.4820                                         max =          8

                                                Wald chi2(5)      =     201.94
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

-------------------------------------------------------------------------------
  fhpolrigaug |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0720744   .0278141     2.59   0.010     .0175598     .126589
              |
         lpop |
          L1. |   -.014805   .0109709    -1.35   0.177    -.0363076    .0066977
              |
    education |
          L1. |   .0413031     .00931     4.44   0.000     .0230558    .0595503
              |
age_veryyoung |
          L1. |  -.2759633   .2810697    -0.98   0.326    -.8268498    .2749232
              |
    age_young |
          L1. |  -1.164202   .4292846    -2.71   0.007    -2.005584   -.3228192
              |
        _cons |   .3590845   .3355362     1.07   0.285    -.2985543    1.016723
--------------+----------------------------------------------------------------
      sigma_u |  .14633985
      sigma_e |  .20596357
          rho |  .33547272   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. > L1.age_old L1.age_veryold i.year_numeric i.colony ,fe cluster(code_numeric)
> is not a valid command name
r(199);

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold 
> i.year_numeric i.colony ,fe cluster(code_numeric)
note: 1.colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
     1.colony |          0  (omitted)
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1184                                         min =          1
     between = 0.4088                                         avg =        7.0
     overall = 0.3334                                         max =         10

                                                F(10,146)         =       6.35
corr(u_i, Xb)  = 0.4496                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0587276   .0420195     1.40   0.164    -.0243175    .1417728
             |
year_numeric |
         33  |   .0575566   .0275762     2.09   0.039     .0030564    .1120568
         34  |    .052962   .0296839     1.78   0.076    -.0057036    .1116276
         35  |   -.099374   .0370808    -2.68   0.008    -.1726584   -.0260896
         36  |  -.1261975   .0419239    -3.01   0.003    -.2090537   -.0433414
         37  |  -.0806147   .0410727    -1.96   0.052    -.1617885     .000559
         38  |   -.061898   .0479339    -1.29   0.199     -.156632    .0328359
         39  |  -.0222524   .0462655    -0.48   0.631    -.1136889    .0691841
         40  |    .025015   .0521551     0.48   0.632    -.0780615    .1280916
         41  |   .0467897   .0518172     0.90   0.368    -.0556189    .1491984
             |
       _cons |   .1244808   .3202462     0.39   0.698    -.5084364    .7573981
-------------+----------------------------------------------------------------
     sigma_u |   .2781524
     sigma_e |  .19311355
         rho |  .67475736   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm i.year
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

. testparm i.year_numeric

 ( 1)  33.year_numeric = 0
 ( 2)  34.year_numeric = 0
 ( 3)  35.year_numeric = 0
 ( 4)  36.year_numeric = 0
 ( 5)  37.year_numeric = 0
 ( 6)  38.year_numeric = 0
 ( 7)  39.year_numeric = 0
 ( 8)  40.year_numeric = 0
 ( 9)  41.year_numeric = 0

       F(  9,   146) =    6.76
            Prob > F =    0.0000

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_ver
> yold i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. testparm i.year
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

. testparm i.year_numeric

 ( 1)  35.year_numeric = 0
 ( 2)  36.year_numeric = 0
 ( 3)  37.year_numeric = 0
 ( 4)  38.year_numeric = 0
 ( 5)  39.year_numeric = 0
 ( 6)  40.year_numeric = 0
 ( 7)  41.year_numeric = 0

       F(  7,    93) =    6.46
            Prob > F =    0.0000

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_ver
> yold i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. testparm i.year_numeric

 ( 1)  35.year_numeric = 0
 ( 2)  36.year_numeric = 0
 ( 3)  37.year_numeric = 0
 ( 4)  38.year_numeric = 0
 ( 5)  39.year_numeric = 0
 ( 6)  40.year_numeric = 0
 ( 7)  41.year_numeric = 0

       F(  7,    93) =    6.46
            Prob > F =    0.0000

. testparm L1.lpop L1.education 

 ( 1)  L.lpop = 0
 ( 2)  L.education = 0

       F(  2,    93) =    0.40
            Prob > F =    0.6721

. testparm L1.age_veryyoung L1.age_young 

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0

       F(  2,    93) =    4.45
            Prob > F =    0.0142

. > L1.age_old L1.age_veryold
> is not a valid command name
r(199);

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    93) =    2.45
            Prob > F =    0.0515

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.midage
variable midage not found
r(111);

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    93) =    2.45
            Prob > F =    0.0515

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_ver
> yold i.year_numeric i.colony ,fe cluster(code_numeric)
note: 1.colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
     1.colony |          0  (omitted)
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. testparm i.year_numeric

 ( 1)  35.year_numeric = 0
 ( 2)  36.year_numeric = 0
 ( 3)  37.year_numeric = 0
 ( 4)  38.year_numeric = 0
 ( 5)  39.year_numeric = 0
 ( 6)  40.year_numeric = 0
 ( 7)  41.year_numeric = 0

       F(  7,    93) =    6.46
            Prob > F =    0.0000

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    93) =    2.45
            Prob > F =    0.0515

. 
. testparm L1.lpop L1.education 

 ( 1)  L.lpop = 0
 ( 2)  L.education = 0

       F(  2,    93) =    0.40
            Prob > F =    0.6721

. xtreg fhpolrigaug L1.lrgdpch L1.age_veryyoung L1.age_young 

Random-effects GLS regression                   Number of obs     =        994
Group variable: code_numeric                    Number of groups  =        141

R-sq:                                           Obs per group:
     within  = 0.0106                                         min =          1
     between = 0.4852                                         avg =        7.0
     overall = 0.4109                                         max =         10

                                                Wald chi2(3)      =     131.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

-------------------------------------------------------------------------------
  fhpolrigaug |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |    .088986   .0194835     4.57   0.000     .0507991     .127173
              |
age_veryyoung |
          L1. |  -.8280766   .2108274    -3.93   0.000    -1.241291   -.4148624
              |
    age_young |
          L1. |  -.9174751   .3767044    -2.44   0.015    -1.655802   -.1791481
              |
        _cons |   .3772752   .2401758     1.57   0.116    -.0934607    .8480112
--------------+----------------------------------------------------------------
      sigma_u |   .1934719
      sigma_e |  .20305859
          rho |   .4758377   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. > L1.age_old L1.age_veryold i.year_numeric i.colony ,fe cluster(code_numeric)
> is not a valid command name
r(199);

. xtreg fhpolrigaug L1.lrgdpch L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_numeric i
> .colony ,fe cluster(code_numeric)
note: 1.colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        994
Group variable: code_numeric                    Number of groups  =        141

R-sq:                                           Obs per group:
     within  = 0.1373                                         min =          1
     between = 0.4870                                         avg =        7.0
     overall = 0.4107                                         max =         10

                                                F(14,140)         =       5.60
corr(u_i, Xb)  = 0.4440                         Prob > F          =     0.0000

                          (Std. Err. adjusted for 141 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0643251   .0423246     1.52   0.131    -.0193528     .148003
              |
age_veryyoung |
          L1. |   2.083499   .7526249     2.77   0.006     .5955187    3.571478
              |
    age_young |
          L1. |   2.031662   .7624795     2.66   0.009      .524199    3.539125
              |
      age_old |
          L1. |   1.443833   1.213416     1.19   0.236    -.9551558    3.842822
              |
  age_veryold |
          L1. |    4.15516    1.38865     2.99   0.003     1.409724    6.900595
              |
 year_numeric |
          33  |    .039794   .0274605     1.45   0.150    -.0144969    .0940848
          34  |   .0214716   .0304641     0.70   0.482    -.0387575    .0817008
          35  |  -.1461232   .0379533    -3.85   0.000    -.2211589   -.0710876
          36  |  -.1891022   .0436566    -4.33   0.000    -.2754137   -.1027908
          37  |  -.1549007   .0445613    -3.48   0.001    -.2430009   -.0668005
          38  |  -.1376907   .0492849    -2.79   0.006    -.2351296   -.0402518
          39  |   -.089025   .0491185    -1.81   0.072     -.186135     .008085
          40  |  -.0326019   .0521316    -0.63   0.533    -.1356688     .070465
          41  |   .0005408   .0528764     0.01   0.992    -.1039986    .1050803
              |
     1.colony |          0  (omitted)
        _cons |  -1.685414   .7736972    -2.18   0.031    -3.215055    -.155773
--------------+----------------------------------------------------------------
      sigma_u |  .25398677
      sigma_e |  .19124932
          rho |  .63816501   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. testparm i.year_numeric

 ( 1)  33.year_numeric = 0
 ( 2)  34.year_numeric = 0
 ( 3)  35.year_numeric = 0
 ( 4)  36.year_numeric = 0
 ( 5)  37.year_numeric = 0
 ( 6)  38.year_numeric = 0
 ( 7)  39.year_numeric = 0
 ( 8)  40.year_numeric = 0
 ( 9)  41.year_numeric = 0

       F(  9,   140) =    8.24
            Prob > F =    0.0000

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,   140) =    2.60
            Prob > F =    0.0389

. 
. testparm L1.lpop L1.education 
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

. testparm L1.lpop L1.education 
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_ver
> yold i.year_numeric i.colony ,fe cluster(code_numeric)
note: 1.colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
     1.colony |          0  (omitted)
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. testparm i.year_numeric

 ( 1)  35.year_numeric = 0
 ( 2)  36.year_numeric = 0
 ( 3)  37.year_numeric = 0
 ( 4)  38.year_numeric = 0
 ( 5)  39.year_numeric = 0
 ( 6)  40.year_numeric = 0
 ( 7)  41.year_numeric = 0

       F(  7,    93) =    6.46
            Prob > F =    0.0000

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    93) =    2.45
            Prob > F =    0.0515

. 
. testparm L1.lpop L1.education 

 ( 1)  L.lpop = 0
 ( 2)  L.education = 0

       F(  2,    93) =    0.40
            Prob > F =    0.6721

. testparm i.colony
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

. testparm colony
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

. testparm i.colony
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

. . xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_v
> eryold i.year_numeric L1.colony ,fe cluster(code_numeric)
note: L.colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
       colony |
          L1. |          0  (omitted)
              |
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. gen is_colony=(colony==1)

. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_v
age_v ambiguous abbreviation
r(111);

. > eryold i.year_numeric is_colony ,fe cluster(code_numeric)
> is not a valid command name
r(199);

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_ver
> yold i.year_numeric is_colony ,fe cluster(code_numeric)
note: is_colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
    is_colony |          0  (omitted)
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_numeric L
> 1.colony ,fe cluster(code_numeric)
note: L.colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        994
Group variable: code_numeric                    Number of groups  =        141

R-sq:                                           Obs per group:
     within  = 0.1373                                         min =          1
     between = 0.4870                                         avg =        7.0
     overall = 0.4107                                         max =         10

                                                F(14,140)         =       5.60
corr(u_i, Xb)  = 0.4440                         Prob > F          =     0.0000

                          (Std. Err. adjusted for 141 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0643251   .0423246     1.52   0.131    -.0193528     .148003
              |
age_veryyoung |
          L1. |   2.083499   .7526249     2.77   0.006     .5955187    3.571478
              |
    age_young |
          L1. |   2.031662   .7624795     2.66   0.009      .524199    3.539125
              |
      age_old |
          L1. |   1.443833   1.213416     1.19   0.236    -.9551558    3.842822
              |
  age_veryold |
          L1. |    4.15516    1.38865     2.99   0.003     1.409724    6.900595
              |
 year_numeric |
          33  |    .039794   .0274605     1.45   0.150    -.0144969    .0940848
          34  |   .0214716   .0304641     0.70   0.482    -.0387575    .0817008
          35  |  -.1461232   .0379533    -3.85   0.000    -.2211589   -.0710876
          36  |  -.1891022   .0436566    -4.33   0.000    -.2754137   -.1027908
          37  |  -.1549007   .0445613    -3.48   0.001    -.2430009   -.0668005
          38  |  -.1376907   .0492849    -2.79   0.006    -.2351296   -.0402518
          39  |   -.089025   .0491185    -1.81   0.072     -.186135     .008085
          40  |  -.0326019   .0521316    -0.63   0.533    -.1356688     .070465
          41  |   .0005408   .0528764     0.01   0.992    -.1039986    .1050803
              |
       colony |
          L1. |          0  (omitted)
              |
        _cons |  -1.685414   .7736972    -2.18   0.031    -3.215055    -.155773
--------------+----------------------------------------------------------------
      sigma_u |  .25398677
      sigma_e |  .19124932
          rho |  .63816501   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_numeric i
> .colony ,fe cluster(code_numeric)
note: 1.colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        994
Group variable: code_numeric                    Number of groups  =        141

R-sq:                                           Obs per group:
     within  = 0.1373                                         min =          1
     between = 0.4870                                         avg =        7.0
     overall = 0.4107                                         max =         10

                                                F(14,140)         =       5.60
corr(u_i, Xb)  = 0.4440                         Prob > F          =     0.0000

                          (Std. Err. adjusted for 141 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0643251   .0423246     1.52   0.131    -.0193528     .148003
              |
age_veryyoung |
          L1. |   2.083499   .7526249     2.77   0.006     .5955187    3.571478
              |
    age_young |
          L1. |   2.031662   .7624795     2.66   0.009      .524199    3.539125
              |
      age_old |
          L1. |   1.443833   1.213416     1.19   0.236    -.9551558    3.842822
              |
  age_veryold |
          L1. |    4.15516    1.38865     2.99   0.003     1.409724    6.900595
              |
 year_numeric |
          33  |    .039794   .0274605     1.45   0.150    -.0144969    .0940848
          34  |   .0214716   .0304641     0.70   0.482    -.0387575    .0817008
          35  |  -.1461232   .0379533    -3.85   0.000    -.2211589   -.0710876
          36  |  -.1891022   .0436566    -4.33   0.000    -.2754137   -.1027908
          37  |  -.1549007   .0445613    -3.48   0.001    -.2430009   -.0668005
          38  |  -.1376907   .0492849    -2.79   0.006    -.2351296   -.0402518
          39  |   -.089025   .0491185    -1.81   0.072     -.186135     .008085
          40  |  -.0326019   .0521316    -0.63   0.533    -.1356688     .070465
          41  |   .0005408   .0528764     0.01   0.992    -.1039986    .1050803
              |
     1.colony |          0  (omitted)
        _cons |  -1.685414   .7736972    -2.18   0.031    -3.215055    -.155773
--------------+----------------------------------------------------------------
      sigma_u |  .25398677
      sigma_e |  .19124932
          rho |  .63816501   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch i.year_numeric i.colony ,fe cluster(code_numeric)
note: 1.colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1184                                         min =          1
     between = 0.4088                                         avg =        7.0
     overall = 0.3334                                         max =         10

                                                F(10,146)         =       6.35
corr(u_i, Xb)  = 0.4496                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0587276   .0420195     1.40   0.164    -.0243175    .1417728
             |
year_numeric |
         33  |   .0575566   .0275762     2.09   0.039     .0030564    .1120568
         34  |    .052962   .0296839     1.78   0.076    -.0057036    .1116276
         35  |   -.099374   .0370808    -2.68   0.008    -.1726584   -.0260896
         36  |  -.1261975   .0419239    -3.01   0.003    -.2090537   -.0433414
         37  |  -.0806147   .0410727    -1.96   0.052    -.1617885     .000559
         38  |   -.061898   .0479339    -1.29   0.199     -.156632    .0328359
         39  |  -.0222524   .0462655    -0.48   0.631    -.1136889    .0691841
         40  |    .025015   .0521551     0.48   0.632    -.0780615    .1280916
         41  |   .0467897   .0518172     0.90   0.368    -.0556189    .1491984
             |
    1.colony |          0  (omitted)
       _cons |   .1244808   .3202462     0.39   0.698    -.5084364    .7573981
-------------+----------------------------------------------------------------
     sigma_u |   .2781524
     sigma_e |  .19311355
         rho |  .67475736   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch i.year_numeric i.socialist ,fe cluster(code_numeric)
note: 1.socialist omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1184                                         min =          1
     between = 0.4088                                         avg =        7.0
     overall = 0.3334                                         max =         10

                                                F(10,146)         =       6.35
corr(u_i, Xb)  = 0.4496                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0587276   .0420195     1.40   0.164    -.0243175    .1417728
             |
year_numeric |
         33  |   .0575566   .0275762     2.09   0.039     .0030564    .1120568
         34  |    .052962   .0296839     1.78   0.076    -.0057036    .1116276
         35  |   -.099374   .0370808    -2.68   0.008    -.1726584   -.0260896
         36  |  -.1261975   .0419239    -3.01   0.003    -.2090537   -.0433414
         37  |  -.0806147   .0410727    -1.96   0.052    -.1617885     .000559
         38  |   -.061898   .0479339    -1.29   0.199     -.156632    .0328359
         39  |  -.0222524   .0462655    -0.48   0.631    -.1136889    .0691841
         40  |    .025015   .0521551     0.48   0.632    -.0780615    .1280916
         41  |   .0467897   .0518172     0.90   0.368    -.0556189    .1491984
             |
 1.socialist |          0  (omitted)
       _cons |   .1244808   .3202462     0.39   0.698    -.5084364    .7573981
-------------+----------------------------------------------------------------
     sigma_u |   .2781524
     sigma_e |  .19311355
         rho |  .67475736   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch i.year_numeric L1.nsave ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1211                                         min =          1
     between = 0.4082                                         avg =        7.0
     overall = 0.3615                                         max =         10

                                                F(11,146)         =       5.88
corr(u_i, Xb)  = 0.4649                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |    .077039   .0473237     1.63   0.106    -.0164889     .170567
             |
year_numeric |
         33  |   .0543754   .0273388     1.99   0.049     .0003444    .1084064
         34  |    .048022   .0295532     1.62   0.106    -.0103854    .1064294
         35  |  -.1049081   .0369442    -2.84   0.005    -.1779226   -.0318936
         36  |  -.1322972   .0421612    -3.14   0.002    -.2156224    -.048972
         37  |   -.089427   .0416831    -2.15   0.034    -.1718072   -.0070468
         38  |  -.0729034   .0487803    -1.49   0.137    -.1693102    .0235034
         39  |  -.0341416   .0471885    -0.72   0.471    -.1274024    .0591192
         40  |   .0131454   .0536699     0.24   0.807    -.0929249    .1192158
         41  |    .034886   .0530615     0.66   0.512    -.0699818    .1397539
             |
       nsave |
         L1. |  -.1596553   .1289336    -1.24   0.218    -.4144726    .0951621
             |
       _cons |   .0103639   .3517037     0.03   0.977    -.6847242     .705452
-------------+----------------------------------------------------------------
     sigma_u |  .27366004
     sigma_e |  .19293427
         rho |  .66798246   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. reg fhpolrigaug L1.lrgdpch, robust

Linear regression                               Number of obs     =      1,023
                                                F(1, 1021)        =     955.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4034
                                                Root MSE          =     .27869

------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .2254815   .0072955    30.91   0.000     .2111657    .2397974
             |
       _cons |  -1.257608   .0624196   -20.15   0.000    -1.380094   -1.135123
------------------------------------------------------------------------------

. rvfplot

. xtreg fhpolrigaug L1.lrgdpch ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.0101                                         min =          1
     between = 0.5137                                         avg =        7.0
     overall = 0.4034                                         max =         10

                                                F(1,146)          =       3.26
corr(u_i, Xb)  = 0.6448                         Prob > F          =     0.0731

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0550704   .0305022     1.81   0.073    -.0052125    .1153533
             |
       _cons |   .1310691   .2485619     0.53   0.599    -.3601752    .6223134
-------------+----------------------------------------------------------------
     sigma_u |  .28130249
     sigma_e |  .20357801
         rho |  .65628054   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. rvfplot
last estimates not found
r(301);

. reg fhpolrigaug L1.lrgdpch, cluster(code_numeric)

Linear regression                               Number of obs     =      1,023
                                                F(1, 146)         =     326.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4034
                                                Root MSE          =     .27869

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .2254815   .0124841    18.06   0.000     .2008087    .2501544
             |
       _cons |  -1.257608   .1060415   -11.86   0.000    -1.467183   -1.048034
------------------------------------------------------------------------------

. rvfplot

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1184                                         min =          1
     between = 0.4088                                         avg =        7.0
     overall = 0.3334                                         max =         10

                                                F(10,146)         =       6.35
corr(u_i, Xb)  = 0.4496                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0587276   .0420195     1.40   0.164    -.0243175    .1417728
             |
year_numeric |
         33  |   .0575566   .0275762     2.09   0.039     .0030564    .1120568
         34  |    .052962   .0296839     1.78   0.076    -.0057036    .1116276
         35  |   -.099374   .0370808    -2.68   0.008    -.1726584   -.0260896
         36  |  -.1261975   .0419239    -3.01   0.003    -.2090537   -.0433414
         37  |  -.0806147   .0410727    -1.96   0.052    -.1617885     .000559
         38  |   -.061898   .0479339    -1.29   0.199     -.156632    .0328359
         39  |  -.0222524   .0462655    -0.48   0.631    -.1136889    .0691841
         40  |    .025015   .0521551     0.48   0.632    -.0780615    .1280916
         41  |   .0467897   .0518172     0.90   0.368    -.0556189    .1491984
             |
       _cons |   .1244808   .3202462     0.39   0.698    -.5084364    .7573981
-------------+----------------------------------------------------------------
     sigma_u |   .2781524
     sigma_e |  .19311355
         rho |  .67475736   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. rvfplot
last estimates not found
r(301);

. twoway (scatter fhpolrigaug L1.lrgdpch)

. reg fhpolrigaug L1.lrgdpch, robust

Linear regression                               Number of obs     =      1,023
                                                F(1, 1021)        =     955.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4034
                                                Root MSE          =     .27869

------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .2254815   .0072955    30.91   0.000     .2111657    .2397974
             |
       _cons |  -1.257608   .0624196   -20.15   0.000    -1.380094   -1.135123
------------------------------------------------------------------------------

. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
     lrgdpch |
         L1. |      1.00    1.000000
-------------+----------------------
    Mean VIF |      1.00

. reg fhpolrigaug L1.lrgdpch, cluster(code_numeric)

Linear regression                               Number of obs     =      1,023
                                                F(1, 146)         =     326.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4034
                                                Root MSE          =     .27869

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .2254815   .0124841    18.06   0.000     .2008087    .2501544
             |
       _cons |  -1.257608   .1060415   -11.86   0.000    -1.467183   -1.048034
------------------------------------------------------------------------------

. 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
     lrgdpch |
         L1. |      1.00    1.000000
-------------+----------------------
    Mean VIF |      1.00

. xtreg fhpolrigaug L1.lrgdpch ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.0101                                         min =          1
     between = 0.5137                                         avg =        7.0
     overall = 0.4034                                         max =         10

                                                F(1,146)          =       3.26
corr(u_i, Xb)  = 0.6448                         Prob > F          =     0.0731

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0550704   .0305022     1.81   0.073    -.0052125    .1153533
             |
       _cons |   .1310691   .2485619     0.53   0.599    -.3601752    .6223134
-------------+----------------------------------------------------------------
     sigma_u |  .28130249
     sigma_e |  .20357801
         rho |  .65628054   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. vif
not appropriate after regress, nocons;
use option uncentered to get uncentered VIFs
r(301);

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1184                                         min =          1
     between = 0.4088                                         avg =        7.0
     overall = 0.3334                                         max =         10

                                                F(10,146)         =       6.35
corr(u_i, Xb)  = 0.4496                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |   .0587276   .0420195     1.40   0.164    -.0243175    .1417728
             |
year_numeric |
         33  |   .0575566   .0275762     2.09   0.039     .0030564    .1120568
         34  |    .052962   .0296839     1.78   0.076    -.0057036    .1116276
         35  |   -.099374   .0370808    -2.68   0.008    -.1726584   -.0260896
         36  |  -.1261975   .0419239    -3.01   0.003    -.2090537   -.0433414
         37  |  -.0806147   .0410727    -1.96   0.052    -.1617885     .000559
         38  |   -.061898   .0479339    -1.29   0.199     -.156632    .0328359
         39  |  -.0222524   .0462655    -0.48   0.631    -.1136889    .0691841
         40  |    .025015   .0521551     0.48   0.632    -.0780615    .1280916
         41  |   .0467897   .0518172     0.90   0.368    -.0556189    .1491984
             |
       _cons |   .1244808   .3202462     0.39   0.698    -.5084364    .7573981
-------------+----------------------------------------------------------------
     sigma_u |   .2781524
     sigma_e |  .19311355
         rho |  .67475736   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. vif
not appropriate after regress, nocons;
use option uncentered to get uncentered VIFs
r(301);

. corr L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_n
> umeric
factor-variable operators not allowed
r(101);

. corr L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold 
(obs=697)

             |        L.       L.       L.       L.       L.       L.       L.
             |  lrgdpch     lpop educat~n age_ve~g age_yo~g  age_old age_ve~d
-------------+---------------------------------------------------------------
     lrgdpch |
         L1. |   1.0000
        lpop |
         L1. |   0.0133   1.0000
   education |
         L1. |   0.8474   0.0572   1.0000
age_veryyo~g |
         L1. |  -0.8260  -0.1421  -0.8236   1.0000
   age_young |
         L1. |  -0.3352   0.0063  -0.3089   0.4283   1.0000
     age_old |
         L1. |   0.7515   0.1331   0.7345  -0.9308  -0.6551   1.0000
 age_veryold |
         L1. |   0.7896   0.0654   0.7780  -0.9353  -0.6294   0.9309   1.0000


. corr L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold year_num
> eric
(obs=697)

             |        L.       L.       L.       L.       L.       L.       L.         
             |  lrgdpch     lpop educat~n age_ve~g age_yo~g  age_old age_ve~d year_n~c
-------------+------------------------------------------------------------------------
     lrgdpch |
         L1. |   1.0000
        lpop |
         L1. |   0.0133   1.0000
   education |
         L1. |   0.8474   0.0572   1.0000
age_veryyo~g |
         L1. |  -0.8260  -0.1421  -0.8236   1.0000
   age_young |
         L1. |  -0.3352   0.0063  -0.3089   0.4283   1.0000
     age_old |
         L1. |   0.7515   0.1331   0.7345  -0.9308  -0.6551   1.0000
 age_veryold |
         L1. |   0.7896   0.0654   0.7780  -0.9353  -0.6294   0.9309   1.0000
year_numeric |   0.1697   0.1359   0.2771  -0.2059   0.2912  -0.0123   0.1164   1.0000


. corr fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_very
> old year_numeric
(obs=685)

             |                 L.       L.       L.       L.       L.       L.       L.         
             | fhpolr~g  lrgdpch     lpop educat~n age_ve~g age_yo~g  age_old age_ve~d year_n~c
-------------+---------------------------------------------------------------------------------
 fhpolrigaug |   1.0000
     lrgdpch |
         L1. |   0.6708   1.0000
        lpop |
         L1. |  -0.0302   0.0113   1.0000
   education |
         L1. |   0.6555   0.8475   0.0562   1.0000
age_veryyo~g |
         L1. |  -0.6225  -0.8269  -0.1359  -0.8240   1.0000
   age_young |
         L1. |  -0.2978  -0.3408   0.0111  -0.3123   0.4307   1.0000
     age_old |
         L1. |   0.5877   0.7538   0.1252   0.7357  -0.9306  -0.6573   1.0000
 age_veryold |
         L1. |   0.6169   0.7908   0.0590   0.7773  -0.9350  -0.6324   0.9311   1.0000
year_numeric |   0.0784   0.1510   0.1246   0.2621  -0.1912   0.2968  -0.0283   0.1010   1.0000


. corr L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold year_num
> eric code_numeric
(obs=697)

             |        L.       L.       L.       L.       L.       L.       L.                  
             |  lrgdpch     lpop educat~n age_ve~g age_yo~g  age_old age_ve~d year_n~c code_n~c
-------------+---------------------------------------------------------------------------------
     lrgdpch |
         L1. |   1.0000
        lpop |
         L1. |   0.0133   1.0000
   education |
         L1. |   0.8474   0.0572   1.0000
age_veryyo~g |
         L1. |  -0.8260  -0.1421  -0.8236   1.0000
   age_young |
         L1. |  -0.3352   0.0063  -0.3089   0.4283   1.0000
     age_old |
         L1. |   0.7515   0.1331   0.7345  -0.9308  -0.6551   1.0000
 age_veryold |
         L1. |   0.7896   0.0654   0.7780  -0.9353  -0.6294   0.9309   1.0000
year_numeric |   0.1697   0.1359   0.2771  -0.2059   0.2912  -0.0123   0.1164   1.0000
code_numeric |  -0.1821   0.0016  -0.1850   0.2402   0.1331  -0.2340  -0.2487  -0.0150   1.0000


.  corr fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_ver
> y old year_numeric code_numeric
age_very ambiguous abbreviation
r(111);

. 
. corr fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_very
> old year_numeric code_numeric
(obs=685)

             |                 L.       L.       L.       L.       L.       L.       L.         
             | fhpolr~g  lrgdpch     lpop educat~n age_ve~g age_yo~g  age_old age_ve~d year_n~c
-------------+---------------------------------------------------------------------------------
 fhpolrigaug |   1.0000
     lrgdpch |
         L1. |   0.6708   1.0000
        lpop |
         L1. |  -0.0302   0.0113   1.0000
   education |
         L1. |   0.6555   0.8475   0.0562   1.0000
age_veryyo~g |
         L1. |  -0.6225  -0.8269  -0.1359  -0.8240   1.0000
   age_young |
         L1. |  -0.2978  -0.3408   0.0111  -0.3123   0.4307   1.0000
     age_old |
         L1. |   0.5877   0.7538   0.1252   0.7357  -0.9306  -0.6573   1.0000
 age_veryold |
         L1. |   0.6169   0.7908   0.0590   0.7773  -0.9350  -0.6324   0.9311   1.0000
year_numeric |   0.0784   0.1510   0.1246   0.2621  -0.1912   0.2968  -0.0283   0.1010   1.0000
code_numeric |  -0.1903  -0.1824   0.0011  -0.1827   0.2408   0.1347  -0.2349  -0.2483  -0.0102

             |          
             | code_n~c
-------------+---------
code_numeric |   1.0000


. 
. log close
      name:  <unnamed>
       log:  /Users/lizzieriese/Desktop/S21/ECO375/ECO375_A2.log
  log type:  text
 closed on:  19 Apr 2021, 20:32:16
---------------------------------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lizzieriese/Desktop/S21/ECO375/ECO375_A2.log
  log type:  text
 opened on:  22 Apr 2021, 14:02:20

. use "/Users/lizzieriese/Desktop/S21/ECO375/Assignment 2/daAssignment2.dta"

. xtset code_numeric year_numeric
       panel variable:  code_numeric (strongly balanced)
        time variable:  year_numeric, 31 to 41
                delta:  1 unit

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_numeric 
> ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0221                                         max =          8

                                                F(14,93)          =       3.85
corr(u_i, Xb)  = -0.4110                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .0159634   .0493456     0.32   0.747    -.0820273     .113954
              |
         lpop |
          L1. |  -.1044867   .1235973    -0.85   0.400    -.3499265    .1409531
              |
    education |
          L1. |  -.0035109    .021996    -0.16   0.874    -.0471906    .0401688
              |
age_veryyoung |
          L1. |   2.618063   .8803168     2.97   0.004      .869928    4.366197
              |
    age_young |
          L1. |   2.108656   .9491122     2.22   0.029     .2239077    3.993405
              |
      age_old |
          L1. |   3.069906   1.498158     2.05   0.043     .0948612    6.044951
              |
  age_veryold |
          L1. |   3.466341   1.801184     1.92   0.057    -.1104541    7.043135
              |
 year_numeric |
          35  |  -.1140041   .0338745    -3.37   0.001    -.1812721   -.0467362
          36  |  -.1394363    .045149    -3.09   0.003    -.2290933   -.0497794
          37  |  -.0623624   .0605108    -1.03   0.305    -.1825249       .0578
          38  |  -.0022158   .0752458    -0.03   0.977     -.151639    .1472074
          39  |   .0560493   .0907682     0.62   0.538    -.1241983     .236297
          40  |   .1178271   .1056793     1.11   0.268     -.092031    .3276852
          41  |   .1639049   .1174213     1.40   0.166    -.0692706    .3970804
              |
        _cons |  -.7281284   1.555147    -0.47   0.641    -3.816342    2.360086
--------------+----------------------------------------------------------------
      sigma_u |  .33547091
      sigma_e |  .19728504
          rho |  .74302891   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. gen demo_sample_0=(e(sample)==1)

. xtreg fhpolrigaug L1.lrgdpch i.year_numeric if demo_sample_0==1 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1048                                         min =          1
     between = 0.5013                                         avg =        7.3
     overall = 0.0061                                         max =          8

                                                F(8,93)           =       5.22
corr(u_i, Xb)  = -0.3041                        Prob > F          =     0.0000

                          (Std. Err. adjusted for 94 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |  -.0228115   .0499336    -0.46   0.649    -.1219697    .0763467
             |
year_numeric |
         35  |  -.1119415   .0310247    -3.61   0.000    -.1735505   -.0503325
         36  |  -.1332268    .034168    -3.90   0.000    -.2010776    -.065376
         37  |  -.0619378   .0337506    -1.84   0.070    -.1289599    .0050843
         38  |  -.0205754   .0382114    -0.54   0.592    -.0964557    .0553048
         39  |   .0098789    .036306     0.27   0.786    -.0622176    .0819755
         40  |   .0409967   .0452398     0.91   0.367    -.0488405     .130834
         41  |   .0663302   .0485305     1.37   0.175    -.0300418    .1627022
             |
       _cons |   .8225487   .3967789     2.07   0.041     .0346243    1.610473
-------------+----------------------------------------------------------------
     sigma_u |  .32069427
     sigma_e |  .19973789
         rho |  .72050433   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. gen lrgdpch2 =  lrgdpch^2
(418 missing values generated)

. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 i.year_numeric ,fe cluster(code_numeric)

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1217                                         min =          1
     between = 0.4453                                         avg =        7.0
     overall = 0.3378                                         max =         10

                                                F(11,146)         =       5.88
corr(u_i, Xb)  = 0.4555                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |  -.2721694   .2613535    -1.04   0.299    -.7886943    .2443555
             |
    lrgdpch2 |
         L1. |   .0200918   .0158502     1.27   0.207    -.0112337    .0514172
             |
year_numeric |
         33  |   .0529936   .0272622     1.94   0.054    -.0008859    .1068731
         34  |   .0453776   .0297898     1.52   0.130    -.0134973    .1042526
         35  |  -.1073719   .0375223    -2.86   0.005    -.1815289   -.0332148
         36  |  -.1345762   .0427502    -3.15   0.002    -.2190655    -.050087
         37  |  -.0894301   .0417695    -2.14   0.034    -.1719812   -.0068791
         38  |   -.072243   .0493405    -1.46   0.145     -.169757    .0252709
         39  |  -.0335742   .0481417    -0.70   0.487    -.1287188    .0615704
         40  |   .0106649   .0548517     0.19   0.846    -.0977411    .1190708
         41  |   .0299436   .0554245     0.54   0.590    -.0795943    .1394815
             |
       _cons |   1.476317   1.092201     1.35   0.179    -.6822506    3.634884
-------------+----------------------------------------------------------------
     sigma_u |  .27793386
     sigma_e |  .19286246
         rho |  .67498338   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L
> 1.age_veryold i.year_numeric ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0228                                         max =          8

                                                F(15,93)          =       3.64
corr(u_i, Xb)  = -0.3954                        Prob > F          =     0.0001

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.0164931   .4139803    -0.04   0.968    -.8385759    .8055898
              |
     lrgdpch2 |
          L1. |    .002057   .0256141     0.08   0.936    -.0488075    .0529215
              |
         lpop |
          L1. |  -.1007324   .1366955    -0.74   0.463    -.3721825    .1707178
              |
    education |
          L1. |    -.00371   .0218815    -0.17   0.866    -.0471622    .0397422
              |
age_veryyoung |
          L1. |   2.630573   .9471674     2.78   0.007     .7496865     4.51146
              |
    age_young |
          L1. |   2.124161   1.032561     2.06   0.042     .0736991    4.174622
              |
      age_old |
          L1. |   3.084825   1.542935     2.00   0.048     .0208613    6.148789
              |
  age_veryold |
          L1. |   3.454033   1.760802     1.96   0.053    -.0425721    6.950637
              |
 year_numeric |
          35  |  -.1147761    .035431    -3.24   0.002     -.185135   -.0444172
          36  |  -.1408059    .051623    -2.73   0.008     -.243319   -.0382929
          37  |  -.0643337   .0703429    -0.91   0.363    -.2040208    .0753534
          38  |  -.0047361    .086433    -0.05   0.956     -.176375    .1669028
          39  |   .0532923   .1033375     0.52   0.607    -.1519155    .2585001
          40  |   .1147034   .1172792     0.98   0.331    -.1181898    .3475965
          41  |   .1603249   .1304961     1.23   0.222    -.0988144    .4194642
              |
        _cons |  -.6428878   1.685713    -0.38   0.704    -3.990379    2.704604
--------------+----------------------------------------------------------------
      sigma_u |  .33271213
      sigma_e |  .19745444
          rho |  .73953237   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.education L1.age_veryyoung L1.age_young L1.age_old L1.age_ve
> ryold i.year_numeric ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1344                                         min =          1
     between = 0.1998                                         avg =        7.3
     overall = 0.1726                                         max =          8

                                                F(14,93)          =       3.87
corr(u_i, Xb)  = 0.1914                         Prob > F          =     0.0000

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.1144032   .3809384    -0.30   0.765    -.8708713    .6420649
              |
     lrgdpch2 |
          L1. |   .0085634      .0232     0.37   0.713    -.0375072     .054634
              |
    education |
          L1. |   -.006917   .0216248    -0.32   0.750    -.0498596    .0360256
              |
age_veryyoung |
          L1. |   2.567305   .9786819     2.62   0.010     .6238366    4.510773
              |
    age_young |
          L1. |   2.014127   1.090614     1.85   0.068    -.1516161     4.17987
              |
      age_old |
          L1. |   2.893272   1.606316     1.80   0.075    -.2965531    6.083097
              |
  age_veryold |
          L1. |   3.979847   1.552346     2.56   0.012     .8971962    7.062498
              |
 year_numeric |
          35  |  -.1286467   .0305929    -4.21   0.000    -.1893981   -.0678954
          36  |  -.1679513   .0365641    -4.59   0.000    -.2405604   -.0953422
          37  |  -.1028582    .041674    -2.47   0.015    -.1856146   -.0201018
          38  |  -.0537447   .0484473    -1.11   0.270    -.1499515     .042462
          39  |  -.0076004   .0523776    -0.15   0.885     -.111612    .0964112
          40  |   .0417121   .0664675     0.63   0.532    -.0902791    .1737033
          41  |   .0771194    .074472     1.04   0.303    -.0707672    .2250061
              |
        _cons |  -1.113405   1.506719    -0.74   0.462     -4.10545    1.878639
--------------+----------------------------------------------------------------
      sigma_u |  .27649704
      sigma_e |   .1974336
          rho |  .66230779   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L
variable L not found
r(111);

. > 1.age_veryold i.year_numeric ,fe cluster(code_numeric) 
> is not a valid command name
r(199);

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        994
Group variable: code_numeric                    Number of groups  =        141

R-sq:                                           Obs per group:
     within  = 0.1383                                         min =          1
     between = 0.5119                                         avg =        7.0
     overall = 0.4071                                         max =         10

                                                F(15,140)         =       5.23
corr(u_i, Xb)  = 0.4622                         Prob > F          =     0.0000

                          (Std. Err. adjusted for 141 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.1462065   .2866878    -0.51   0.611    -.7130037    .4205907
              |
     lrgdpch2 |
          L1. |   .0132944   .0174757     0.76   0.448    -.0212561    .0478449
              |
age_veryyoung |
          L1. |   2.188565   .7890694     2.77   0.006      .628532    3.748597
              |
    age_young |
          L1. |   2.136659   .7844691     2.72   0.007     .5857217    3.687597
              |
      age_old |
          L1. |   1.655368   1.286271     1.29   0.200    -.8876584    4.198394
              |
  age_veryold |
          L1. |   3.863658   1.365666     2.83   0.005     1.163663    6.563652
              |
 year_numeric |
          33  |   .0370334   .0280738     1.32   0.189    -.0184701    .0925369
          34  |   .0174392   .0314097     0.56   0.580    -.0446595    .0795378
          35  |  -.1505369   .0391205    -3.85   0.000    -.2278802   -.0731936
          36  |  -.1937958   .0453948    -4.27   0.000    -.2835436   -.1040479
          37  |  -.1601461   .0463264    -3.46   0.001     -.251736   -.0685563
          38  |  -.1441252   .0514886    -2.80   0.006     -.245921   -.0423294
          39  |  -.0944607   .0511987    -1.84   0.067    -.1956833     .006762
          40  |  -.0381722   .0536016    -0.71   0.478    -.1441453     .067801
          41  |  -.0053916   .0546497    -0.10   0.922    -.1134369    .1026538
              |
        _cons |  -.9265056   1.223454    -0.76   0.450    -3.345339    1.492328
--------------+----------------------------------------------------------------
      sigma_u |  .25704663
      sigma_e |  .19125114
          rho |  .64367257   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 i.year_numeric ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1217                                         min =          1
     between = 0.4453                                         avg =        7.0
     overall = 0.3378                                         max =         10

                                                F(11,146)         =       5.88
corr(u_i, Xb)  = 0.4555                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |  -.2721694   .2613535    -1.04   0.299    -.7886943    .2443555
             |
    lrgdpch2 |
         L1. |   .0200918   .0158502     1.27   0.207    -.0112337    .0514172
             |
year_numeric |
         33  |   .0529936   .0272622     1.94   0.054    -.0008859    .1068731
         34  |   .0453776   .0297898     1.52   0.130    -.0134973    .1042526
         35  |  -.1073719   .0375223    -2.86   0.005    -.1815289   -.0332148
         36  |  -.1345762   .0427502    -3.15   0.002    -.2190655    -.050087
         37  |  -.0894301   .0417695    -2.14   0.034    -.1719812   -.0068791
         38  |   -.072243   .0493405    -1.46   0.145     -.169757    .0252709
         39  |  -.0335742   .0481417    -0.70   0.487    -.1287188    .0615704
         40  |   .0106649   .0548517     0.19   0.846    -.0977411    .1190708
         41  |   .0299436   .0554245     0.54   0.590    -.0795943    .1394815
             |
       _cons |   1.476317   1.092201     1.35   0.179    -.6822506    3.634884
-------------+----------------------------------------------------------------
     sigma_u |  .27793386
     sigma_e |  .19286246
         rho |  .67498338   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 i.year_numeric i.colony ,fe cluster(code_numeric) 
note: 1.colony omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1217                                         min =          1
     between = 0.4453                                         avg =        7.0
     overall = 0.3378                                         max =         10

                                                F(11,146)         =       5.88
corr(u_i, Xb)  = 0.4555                         Prob > F          =     0.0000

                         (Std. Err. adjusted for 147 clusters in code_numeric)
------------------------------------------------------------------------------
             |               Robust
 fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |  -.2721694   .2613535    -1.04   0.299    -.7886943    .2443555
             |
    lrgdpch2 |
         L1. |   .0200918   .0158502     1.27   0.207    -.0112337    .0514172
             |
year_numeric |
         33  |   .0529936   .0272622     1.94   0.054    -.0008859    .1068731
         34  |   .0453776   .0297898     1.52   0.130    -.0134973    .1042526
         35  |  -.1073719   .0375223    -2.86   0.005    -.1815289   -.0332148
         36  |  -.1345762   .0427502    -3.15   0.002    -.2190655    -.050087
         37  |  -.0894301   .0417695    -2.14   0.034    -.1719812   -.0068791
         38  |   -.072243   .0493405    -1.46   0.145     -.169757    .0252709
         39  |  -.0335742   .0481417    -0.70   0.487    -.1287188    .0615704
         40  |   .0106649   .0548517     0.19   0.846    -.0977411    .1190708
         41  |   .0299436   .0554245     0.54   0.590    -.0795943    .1394815
             |
    1.colony |          0  (omitted)
       _cons |   1.476317   1.092201     1.35   0.179    -.6822506    3.634884
-------------+----------------------------------------------------------------
     sigma_u |  .27793386
     sigma_e |  .19286246
         rho |  .67498338   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 i.year_numeric i.colony

Random-effects GLS regression                   Number of obs     =      1,023
Group variable: code_numeric                    Number of groups  =        147

R-sq:                                           Obs per group:
     within  = 0.1030                                         min =          1
     between = 0.5481                                         avg =        7.0
     overall = 0.4729                                         max =         10

                                                Wald chi2(12)     =     285.66
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
 fhpolrigaug |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lrgdpch |
         L1. |  -.2363555   .1579264    -1.50   0.134    -.5458855    .0731745
             |
    lrgdpch2 |
         L1. |   .0258453   .0096546     2.68   0.007     .0069227    .0447679
             |
year_numeric |
         33  |   .0328636   .0407204     0.81   0.420    -.0469469    .1126741
         34  |  -.0063636    .038788    -0.16   0.870    -.0823868    .0696595
         35  |  -.1783895   .0386547    -4.61   0.000    -.2541513   -.1026277
         36  |  -.2254459   .0387015    -5.83   0.000    -.3012995   -.1495923
         37  |   -.193187   .0389219    -4.96   0.000    -.2694725   -.1169016
         38  |  -.1830868   .0391013    -4.68   0.000     -.259724   -.1064497
         39  |  -.1510149    .039279    -3.84   0.000    -.2280004   -.0740294
         40  |  -.1212203   .0397723    -3.05   0.002    -.1991726    -.043268
         41  |  -.1101583   .0396294    -2.78   0.005    -.1878304   -.0324862
             |
    1.colony |   .0092859   .0380484     0.24   0.807    -.0652877    .0838595
       _cons |   .8780655   .6467274     1.36   0.175    -.3894969    2.145628
-------------+----------------------------------------------------------------
     sigma_u |  .17060766
     sigma_e |  .19286246
         rho |       .439   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        994
Group variable: code_numeric                    Number of groups  =        141

R-sq:                                           Obs per group:
     within  = 0.1383                                         min =          1
     between = 0.5119                                         avg =        7.0
     overall = 0.4071                                         max =         10

                                                F(15,140)         =       5.23
corr(u_i, Xb)  = 0.4622                         Prob > F          =     0.0000

                          (Std. Err. adjusted for 141 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.1462065   .2866878    -0.51   0.611    -.7130037    .4205907
              |
     lrgdpch2 |
          L1. |   .0132944   .0174757     0.76   0.448    -.0212561    .0478449
              |
age_veryyoung |
          L1. |   2.188565   .7890694     2.77   0.006      .628532    3.748597
              |
    age_young |
          L1. |   2.136659   .7844691     2.72   0.007     .5857217    3.687597
              |
      age_old |
          L1. |   1.655368   1.286271     1.29   0.200    -.8876584    4.198394
              |
  age_veryold |
          L1. |   3.863658   1.365666     2.83   0.005     1.163663    6.563652
              |
 year_numeric |
          33  |   .0370334   .0280738     1.32   0.189    -.0184701    .0925369
          34  |   .0174392   .0314097     0.56   0.580    -.0446595    .0795378
          35  |  -.1505369   .0391205    -3.85   0.000    -.2278802   -.0731936
          36  |  -.1937958   .0453948    -4.27   0.000    -.2835436   -.1040479
          37  |  -.1601461   .0463264    -3.46   0.001     -.251736   -.0685563
          38  |  -.1441252   .0514886    -2.80   0.006     -.245921   -.0423294
          39  |  -.0944607   .0511987    -1.84   0.067    -.1956833     .006762
          40  |  -.0381722   .0536016    -0.71   0.478    -.1441453     .067801
          41  |  -.0053916   .0546497    -0.10   0.922    -.1134369    .1026538
              |
        _cons |  -.9265056   1.223454    -0.76   0.450    -3.345339    1.492328
--------------+----------------------------------------------------------------
      sigma_u |  .25704663
      sigma_e |  .19125114
          rho |  .64367257   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. testparm i.year_numeric

 ( 1)  33.year_numeric = 0
 ( 2)  34.year_numeric = 0
 ( 3)  35.year_numeric = 0
 ( 4)  36.year_numeric = 0
 ( 5)  37.year_numeric = 0
 ( 6)  38.year_numeric = 0
 ( 7)  39.year_numeric = 0
 ( 8)  40.year_numeric = 0
 ( 9)  41.year_numeric = 0

       F(  9,   140) =    8.24
            Prob > F =    0.0000

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,   140) =    2.53
            Prob > F =    0.0431

. 
. testparm L1.lpop L1.education 
no such variables;
the specified varlist does not identify any testable coefficients
r(111);

. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L
> 1.age_veryold i.year_numeric ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        685
Group variable: code_numeric                    Number of groups  =         94

R-sq:                                           Obs per group:
     within  = 0.1357                                         min =          1
     between = 0.0086                                         avg =        7.3
     overall = 0.0228                                         max =          8

                                                F(15,93)          =       3.64
corr(u_i, Xb)  = -0.3954                        Prob > F          =     0.0001

                           (Std. Err. adjusted for 94 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.0164931   .4139803    -0.04   0.968    -.8385759    .8055898
              |
     lrgdpch2 |
          L1. |    .002057   .0256141     0.08   0.936    -.0488075    .0529215
              |
         lpop |
          L1. |  -.1007324   .1366955    -0.74   0.463    -.3721825    .1707178
              |
    education |
          L1. |    -.00371   .0218815    -0.17   0.866    -.0471622    .0397422
              |
age_veryyoung |
          L1. |   2.630573   .9471674     2.78   0.007     .7496865     4.51146
              |
    age_young |
          L1. |   2.124161   1.032561     2.06   0.042     .0736991    4.174622
              |
      age_old |
          L1. |   3.084825   1.542935     2.00   0.048     .0208613    6.148789
              |
  age_veryold |
          L1. |   3.454033   1.760802     1.96   0.053    -.0425721    6.950637
              |
 year_numeric |
          35  |  -.1147761    .035431    -3.24   0.002     -.185135   -.0444172
          36  |  -.1408059    .051623    -2.73   0.008     -.243319   -.0382929
          37  |  -.0643337   .0703429    -0.91   0.363    -.2040208    .0753534
          38  |  -.0047361    .086433    -0.05   0.956     -.176375    .1669028
          39  |   .0532923   .1033375     0.52   0.607    -.1519155    .2585001
          40  |   .1147034   .1172792     0.98   0.331    -.1181898    .3475965
          41  |   .1603249   .1304961     1.23   0.222    -.0988144    .4194642
              |
        _cons |  -.6428878   1.685713    -0.38   0.704    -3.990379    2.704604
--------------+----------------------------------------------------------------
      sigma_u |  .33271213
      sigma_e |  .19745444
          rho |  .73953237   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. testparm i.year_numeric

 ( 1)  35.year_numeric = 0
 ( 2)  36.year_numeric = 0
 ( 3)  37.year_numeric = 0
 ( 4)  38.year_numeric = 0
 ( 5)  39.year_numeric = 0
 ( 6)  40.year_numeric = 0
 ( 7)  41.year_numeric = 0

       F(  7,    93) =    6.40
            Prob > F =    0.0000

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    93) =    2.20
            Prob > F =    0.0755

. 
. testparm L1.lpop L1.education 

 ( 1)  L.lpop = 0
 ( 2)  L.education = 0

       F(  2,    93) =    0.31
            Prob > F =    0.7341

. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        994
Group variable: code_numeric                    Number of groups  =        141

R-sq:                                           Obs per group:
     within  = 0.1383                                         min =          1
     between = 0.5119                                         avg =        7.0
     overall = 0.4071                                         max =         10

                                                F(15,140)         =       5.23
corr(u_i, Xb)  = 0.4622                         Prob > F          =     0.0000

                          (Std. Err. adjusted for 141 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.1462065   .2866878    -0.51   0.611    -.7130037    .4205907
              |
     lrgdpch2 |
          L1. |   .0132944   .0174757     0.76   0.448    -.0212561    .0478449
              |
age_veryyoung |
          L1. |   2.188565   .7890694     2.77   0.006      .628532    3.748597
              |
    age_young |
          L1. |   2.136659   .7844691     2.72   0.007     .5857217    3.687597
              |
      age_old |
          L1. |   1.655368   1.286271     1.29   0.200    -.8876584    4.198394
              |
  age_veryold |
          L1. |   3.863658   1.365666     2.83   0.005     1.163663    6.563652
              |
 year_numeric |
          33  |   .0370334   .0280738     1.32   0.189    -.0184701    .0925369
          34  |   .0174392   .0314097     0.56   0.580    -.0446595    .0795378
          35  |  -.1505369   .0391205    -3.85   0.000    -.2278802   -.0731936
          36  |  -.1937958   .0453948    -4.27   0.000    -.2835436   -.1040479
          37  |  -.1601461   .0463264    -3.46   0.001     -.251736   -.0685563
          38  |  -.1441252   .0514886    -2.80   0.006     -.245921   -.0423294
          39  |  -.0944607   .0511987    -1.84   0.067    -.1956833     .006762
          40  |  -.0381722   .0536016    -0.71   0.478    -.1441453     .067801
          41  |  -.0053916   .0546497    -0.10   0.922    -.1134369    .1026538
              |
        _cons |  -.9265056   1.223454    -0.76   0.450    -3.345339    1.492328
--------------+----------------------------------------------------------------
      sigma_u |  .25704663
      sigma_e |  .19125114
          rho |  .64367257   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. testparm i.year_numeric

 ( 1)  33.year_numeric = 0
 ( 2)  34.year_numeric = 0
 ( 3)  35.year_numeric = 0
 ( 4)  36.year_numeric = 0
 ( 5)  37.year_numeric = 0
 ( 6)  38.year_numeric = 0
 ( 7)  39.year_numeric = 0
 ( 8)  40.year_numeric = 0
 ( 9)  41.year_numeric = 0

       F(  9,   140) =    8.24
            Prob > F =    0.0000

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,   140) =    2.53
            Prob > F =    0.0431

. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L
> 1.age_veryold i.year_numeric if colony==1 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        508
Group variable: code_numeric                    Number of groups  =         71

R-sq:                                           Obs per group:
     within  = 0.1368                                         min =          1
     between = 0.0221                                         avg =        7.2
     overall = 0.0018                                         max =          8

                                                F(15,70)          =       4.09
corr(u_i, Xb)  = -0.6563                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 71 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.2678313   .4864542    -0.55   0.584    -1.238034    .7023711
              |
     lrgdpch2 |
          L1. |   .0147686    .030027     0.49   0.624    -.0451184    .0746557
              |
         lpop |
          L1. |  -.1353811   .1749733    -0.77   0.442    -.4843545    .2135922
              |
    education |
          L1. |  -.0037748    .027375    -0.14   0.891    -.0583725    .0508229
              |
age_veryyoung |
          L1. |   2.523401   1.031734     2.45   0.017     .4656713     4.58113
              |
    age_young |
          L1. |   2.110694   1.269388     1.66   0.101    -.4210215    4.642409
              |
      age_old |
          L1. |   2.288759   2.532762     0.90   0.369    -2.762676    7.340194
              |
  age_veryold |
          L1. |   2.691509   2.124289     1.27   0.209    -1.545251    6.928269
              |
 year_numeric |
          35  |  -.1327441   .0450103    -2.95   0.004    -.2225144   -.0429738
          36  |  -.1698533   .0607255    -2.80   0.007    -.2909665   -.0487402
          37  |  -.0803574    .082958    -0.97   0.336    -.2458119     .085097
          38  |  -.0136245   .1050022    -0.13   0.897    -.2230447    .1957957
          39  |   .0381162   .1282081     0.30   0.767    -.2175867    .2938191
          40  |   .1262762   .1437328     0.88   0.383    -.1603898    .4129421
          41  |   .1909219   .1593588     1.20   0.235    -.1269091    .5087529
              |
        _cons |   .9571652   2.057557     0.47   0.643    -3.146504    5.060834
--------------+----------------------------------------------------------------
      sigma_u |  .39302704
      sigma_e |  .20596038
          rho |  .78455131   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric if colony==1 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        740
Group variable: code_numeric                    Number of groups  =         98

R-sq:                                           Obs per group:
     within  = 0.1451                                         min =          1
     between = 0.0608                                         avg =        7.6
     overall = 0.0054                                         max =         10

                                                F(15,97)          =       5.39
corr(u_i, Xb)  = -0.1962                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 98 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   -.304062   .3270685    -0.93   0.355    -.9532025    .3450785
              |
     lrgdpch2 |
          L1. |   .0190291   .0200523     0.95   0.345    -.0207692    .0588274
              |
age_veryyoung |
          L1. |   1.574163    .882051     1.78   0.077    -.1764643     3.32479
              |
    age_young |
          L1. |   1.992231   .9376614     2.12   0.036     .1312325    3.853229
              |
      age_old |
          L1. |  -.0992037   1.945216    -0.05   0.959    -3.959918    3.761511
              |
  age_veryold |
          L1. |   2.697006   1.754353     1.54   0.127    -.7848992    6.178911
              |
 year_numeric |
          33  |   .0831094   .0393467     2.11   0.037     .0050171    .1612017
          34  |   .0747984   .0402812     1.86   0.066    -.0051488    .1547455
          35  |    -.11298   .0502473    -2.25   0.027     -.212707   -.0132529
          36  |  -.1588923   .0526809    -3.02   0.003    -.2634493   -.0543353
          37  |  -.1229005   .0530912    -2.31   0.023    -.2282718   -.0175292
          38  |    -.11306   .0593568    -1.90   0.060    -.2308669    .0047469
          39  |  -.0715547   .0580982    -1.23   0.221    -.1868634    .0437541
          40  |  -.0000637   .0577836    -0.00   0.999    -.1147482    .1146208
          41  |   .0360315   .0594121     0.61   0.546    -.0818851    .1539481
              |
        _cons |   .4445186   1.313676     0.34   0.736    -2.162764    3.051801
--------------+----------------------------------------------------------------
      sigma_u |  .31905504
      sigma_e |  .19739239
          rho |   .7231899   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric if colony==0 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        254
Group variable: code_numeric                    Number of groups  =         43

R-sq:                                           Obs per group:
     within  = 0.2968                                         min =          1
     between = 0.5866                                         avg =        5.9
     overall = 0.6315                                         max =         10

                                                F(15,42)          =       3.36
corr(u_i, Xb)  = -0.2028                        Prob > F          =     0.0010

                           (Std. Err. adjusted for 43 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .9517438   .5531278     1.72   0.093    -.1645133    2.068001
              |
     lrgdpch2 |
          L1. |  -.0402004   .0327556    -1.23   0.227     -.106304    .0259031
              |
age_veryyoung |
          L1. |   3.543784   1.411924     2.51   0.016     .6944061    6.393161
              |
    age_young |
          L1. |   2.108829   1.175231     1.79   0.080    -.2628827    4.480542
              |
      age_old |
          L1. |    2.14804   1.603177     1.34   0.187    -1.087301    5.383382
              |
  age_veryold |
          L1. |   5.319368   1.925126     2.76   0.008     1.434307    9.204429
              |
 year_numeric |
          33  |  -.0474286   .0332297    -1.43   0.161    -.1144888    .0196316
          34  |  -.1386489   .0485985    -2.85   0.007    -.2367247   -.0405732
          35  |  -.2686604   .0532379    -5.05   0.000    -.3760989   -.1612219
          36  |  -.3274648   .0891026    -3.68   0.001    -.5072811   -.1476486
          37  |  -.3159373   .0978138    -3.23   0.002    -.5133336   -.1185411
          38  |  -.2707624    .087785    -3.08   0.004    -.4479198    -.093605
          39  |  -.2146437   .0948009    -2.26   0.029    -.4059596   -.0233279
          40  |  -.2375839   .1150187    -2.07   0.045     -.469701   -.0054668
          41  |  -.2214964   .1163202    -1.90   0.064      -.45624    .0132472
              |
        _cons |  -6.799437    2.44654    -2.78   0.008    -11.73675    -1.86212
--------------+----------------------------------------------------------------
      sigma_u |  .21972441
      sigma_e |  .15838351
          rho |  .65807094   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L
> 1.age_veryold i.year_numeric if colony==0 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        177
Group variable: code_numeric                    Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.3448                                         min =          5
     between = 0.3753                                         avg =        7.7
     overall = 0.2764                                         max =          8

                                                F(15,22)          =       8.03
corr(u_i, Xb)  = -0.9226                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 23 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   2.573117   1.428379     1.80   0.085     -.389161    5.535394
              |
     lrgdpch2 |
          L1. |   -.136333   .0849828    -1.60   0.123    -.3125764    .0399105
              |
         lpop |
          L1. |  -.5055512   .3561383    -1.42   0.170    -1.244137    .2330345
              |
    education |
          L1. |   .0097182   .0222632     0.44   0.667    -.0364528    .0558892
              |
age_veryyoung |
          L1. |     3.8977    1.73479     2.25   0.035     .2999659    7.495435
              |
    age_young |
          L1. |   1.773009   1.732062     1.02   0.317    -1.819068    5.365086
              |
      age_old |
          L1. |   3.550769   1.475694     2.41   0.025     .4903679     6.61117
              |
  age_veryold |
          L1. |   4.301504   2.623658     1.64   0.115     -1.13963    9.742637
              |
 year_numeric |
          35  |  -.0664563   .0646579    -1.03   0.315    -.2005485    .0676359
          36  |  -.0463266   .1236856    -0.37   0.712    -.3028348    .2101815
          37  |   .0344676    .158264     0.22   0.830     -.293752    .3626871
          38  |   .1110336   .1840535     0.60   0.552      -.27067    .4927371
          39  |   .2175342   .2133616     1.02   0.319    -.2249508    .6600192
          40  |   .2343118   .2558602     0.92   0.370    -.2963097    .7649334
          41  |   .2236785   .2760055     0.81   0.426    -.3487219    .7960788
              |
        _cons |   -9.02858   3.980235    -2.27   0.033    -17.28308   -.7740781
--------------+----------------------------------------------------------------
      sigma_u |   .6551863
      sigma_e |  .15722727
          rho |  .94554849   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. testparm i.year_numeric

 ( 1)  35.year_numeric = 0
 ( 2)  36.year_numeric = 0
 ( 3)  37.year_numeric = 0
 ( 4)  38.year_numeric = 0
 ( 5)  39.year_numeric = 0
 ( 6)  40.year_numeric = 0
 ( 7)  41.year_numeric = 0

       F(  7,    22) =    5.66
            Prob > F =    0.0008

. testparm L1.lpop L1.education 

 ( 1)  L.lpop = 0
 ( 2)  L.education = 0

       F(  2,    22) =    1.13
            Prob > F =    0.3416

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    22) =    2.34
            Prob > F =    0.0863

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric if colony==0 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        254
Group variable: code_numeric                    Number of groups  =         43

R-sq:                                           Obs per group:
     within  = 0.2968                                         min =          1
     between = 0.5866                                         avg =        5.9
     overall = 0.6315                                         max =         10

                                                F(15,42)          =       3.36
corr(u_i, Xb)  = -0.2028                        Prob > F          =     0.0010

                           (Std. Err. adjusted for 43 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .9517438   .5531278     1.72   0.093    -.1645133    2.068001
              |
     lrgdpch2 |
          L1. |  -.0402004   .0327556    -1.23   0.227     -.106304    .0259031
              |
age_veryyoung |
          L1. |   3.543784   1.411924     2.51   0.016     .6944061    6.393161
              |
    age_young |
          L1. |   2.108829   1.175231     1.79   0.080    -.2628827    4.480542
              |
      age_old |
          L1. |    2.14804   1.603177     1.34   0.187    -1.087301    5.383382
              |
  age_veryold |
          L1. |   5.319368   1.925126     2.76   0.008     1.434307    9.204429
              |
 year_numeric |
          33  |  -.0474286   .0332297    -1.43   0.161    -.1144888    .0196316
          34  |  -.1386489   .0485985    -2.85   0.007    -.2367247   -.0405732
          35  |  -.2686604   .0532379    -5.05   0.000    -.3760989   -.1612219
          36  |  -.3274648   .0891026    -3.68   0.001    -.5072811   -.1476486
          37  |  -.3159373   .0978138    -3.23   0.002    -.5133336   -.1185411
          38  |  -.2707624    .087785    -3.08   0.004    -.4479198    -.093605
          39  |  -.2146437   .0948009    -2.26   0.029    -.4059596   -.0233279
          40  |  -.2375839   .1150187    -2.07   0.045     -.469701   -.0054668
          41  |  -.2214964   .1163202    -1.90   0.064      -.45624    .0132472
              |
        _cons |  -6.799437    2.44654    -2.78   0.008    -11.73675    -1.86212
--------------+----------------------------------------------------------------
      sigma_u |  .21972441
      sigma_e |  .15838351
          rho |  .65807094   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. testparm i.year_numeric

 ( 1)  33.year_numeric = 0
 ( 2)  34.year_numeric = 0
 ( 3)  35.year_numeric = 0
 ( 4)  36.year_numeric = 0
 ( 5)  37.year_numeric = 0
 ( 6)  38.year_numeric = 0
 ( 7)  39.year_numeric = 0
 ( 8)  40.year_numeric = 0
 ( 9)  41.year_numeric = 0

       F(  9,    42) =    3.80
            Prob > F =    0.0014

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    42) =    2.12
            Prob > F =    0.0949

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric if colony==1 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        740
Group variable: code_numeric                    Number of groups  =         98

R-sq:                                           Obs per group:
     within  = 0.1451                                         min =          1
     between = 0.0608                                         avg =        7.6
     overall = 0.0054                                         max =         10

                                                F(15,97)          =       5.39
corr(u_i, Xb)  = -0.1962                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 98 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   -.304062   .3270685    -0.93   0.355    -.9532025    .3450785
              |
     lrgdpch2 |
          L1. |   .0190291   .0200523     0.95   0.345    -.0207692    .0588274
              |
age_veryyoung |
          L1. |   1.574163    .882051     1.78   0.077    -.1764643     3.32479
              |
    age_young |
          L1. |   1.992231   .9376614     2.12   0.036     .1312325    3.853229
              |
      age_old |
          L1. |  -.0992037   1.945216    -0.05   0.959    -3.959918    3.761511
              |
  age_veryold |
          L1. |   2.697006   1.754353     1.54   0.127    -.7848992    6.178911
              |
 year_numeric |
          33  |   .0831094   .0393467     2.11   0.037     .0050171    .1612017
          34  |   .0747984   .0402812     1.86   0.066    -.0051488    .1547455
          35  |    -.11298   .0502473    -2.25   0.027     -.212707   -.0132529
          36  |  -.1588923   .0526809    -3.02   0.003    -.2634493   -.0543353
          37  |  -.1229005   .0530912    -2.31   0.023    -.2282718   -.0175292
          38  |    -.11306   .0593568    -1.90   0.060    -.2308669    .0047469
          39  |  -.0715547   .0580982    -1.23   0.221    -.1868634    .0437541
          40  |  -.0000637   .0577836    -0.00   0.999    -.1147482    .1146208
          41  |   .0360315   .0594121     0.61   0.546    -.0818851    .1539481
              |
        _cons |   .4445186   1.313676     0.34   0.736    -2.162764    3.051801
--------------+----------------------------------------------------------------
      sigma_u |  .31905504
      sigma_e |  .19739239
          rho |   .7231899   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric if colony==1 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        740
Group variable: code_numeric                    Number of groups  =         98

R-sq:                                           Obs per group:
     within  = 0.1451                                         min =          1
     between = 0.0608                                         avg =        7.6
     overall = 0.0054                                         max =         10

                                                F(15,97)          =       5.39
corr(u_i, Xb)  = -0.1962                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 98 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   -.304062   .3270685    -0.93   0.355    -.9532025    .3450785
              |
     lrgdpch2 |
          L1. |   .0190291   .0200523     0.95   0.345    -.0207692    .0588274
              |
age_veryyoung |
          L1. |   1.574163    .882051     1.78   0.077    -.1764643     3.32479
              |
    age_young |
          L1. |   1.992231   .9376614     2.12   0.036     .1312325    3.853229
              |
      age_old |
          L1. |  -.0992037   1.945216    -0.05   0.959    -3.959918    3.761511
              |
  age_veryold |
          L1. |   2.697006   1.754353     1.54   0.127    -.7848992    6.178911
              |
 year_numeric |
          33  |   .0831094   .0393467     2.11   0.037     .0050171    .1612017
          34  |   .0747984   .0402812     1.86   0.066    -.0051488    .1547455
          35  |    -.11298   .0502473    -2.25   0.027     -.212707   -.0132529
          36  |  -.1588923   .0526809    -3.02   0.003    -.2634493   -.0543353
          37  |  -.1229005   .0530912    -2.31   0.023    -.2282718   -.0175292
          38  |    -.11306   .0593568    -1.90   0.060    -.2308669    .0047469
          39  |  -.0715547   .0580982    -1.23   0.221    -.1868634    .0437541
          40  |  -.0000637   .0577836    -0.00   0.999    -.1147482    .1146208
          41  |   .0360315   .0594121     0.61   0.546    -.0818851    .1539481
              |
        _cons |   .4445186   1.313676     0.34   0.736    -2.162764    3.051801
--------------+----------------------------------------------------------------
      sigma_u |  .31905504
      sigma_e |  .19739239
          rho |   .7231899   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. testparm i.year_numeric

 ( 1)  33.year_numeric = 0
 ( 2)  34.year_numeric = 0
 ( 3)  35.year_numeric = 0
 ( 4)  36.year_numeric = 0
 ( 5)  37.year_numeric = 0
 ( 6)  38.year_numeric = 0
 ( 7)  39.year_numeric = 0
 ( 8)  40.year_numeric = 0
 ( 9)  41.year_numeric = 0

       F(  9,    97) =    8.15
            Prob > F =    0.0000

. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    97) =    1.82
            Prob > F =    0.1320

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric if socialist==1 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =         43
Group variable: code_numeric                    Number of groups  =         22

R-sq:                                           Obs per group:
     within  = 0.9312                                         min =          1
     between = 0.5581                                         avg =        2.0
     overall = 0.5499                                         max =          8

                                                F(8,21)           =          .
corr(u_i, Xb)  = -0.6137                        Prob > F          =          .

                           (Std. Err. adjusted for 22 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   -5.38526   1.741527    -3.09   0.006    -9.006963   -1.763557
              |
     lrgdpch2 |
          L1. |   .3089532   .1002476     3.08   0.006     .1004768    .5174296
              |
age_veryyoung |
          L1. |   .5371243    11.5562     0.05   0.963     -23.4953    24.56955
              |
    age_young |
          L1. |   .3157019    5.94882     0.05   0.958    -12.05555    12.68695
              |
      age_old |
          L1. |   .5959093   6.225612     0.10   0.925    -12.35096    13.54278
              |
  age_veryold |
          L1. |   13.93735   8.998538     1.55   0.136    -4.776138    32.65083
              |
 year_numeric |
          35  |  -.0455748   .2619575    -0.17   0.864    -.5903452    .4991956
          36  |   .0538248   .2981202     0.18   0.858      -.56615    .6737996
          37  |   .0150141   .3476053     0.04   0.966    -.7078708     .737899
          38  |   .0883335   .2294342     0.39   0.704    -.3888011    .5654681
          39  |   .5245927   .3641853     1.44   0.164    -.2327721    1.281957
          40  |   .6050262    .426271     1.42   0.170    -.2814528    1.491505
          41  |   .5751473   .4665642     1.23   0.231    -.3951261    1.545421
              |
        _cons |   21.00368   7.298808     2.88   0.009      5.82498    36.18239
--------------+----------------------------------------------------------------
      sigma_u |  .35484934
      sigma_e |  .13111523
          rho |  .87987357   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_
> numeric if socialist==0 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        951
Group variable: code_numeric                    Number of groups  =        119

R-sq:                                           Obs per group:
     within  = 0.1271                                         min =          1
     between = 0.5469                                         avg =        8.0
     overall = 0.3962                                         max =         10

                                                F(15,118)         =       5.03
corr(u_i, Xb)  = 0.4841                         Prob > F          =     0.0000

                          (Std. Err. adjusted for 119 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.2453558   .2926987    -0.84   0.404    -.8249789    .3342673
              |
     lrgdpch2 |
          L1. |   .0191653   .0178473     1.07   0.285    -.0161772    .0545079
              |
age_veryyoung |
          L1. |   2.219143   .8074935     2.75   0.007     .6200858      3.8182
              |
    age_young |
          L1. |   2.471263   .7319618     3.38   0.001      1.02178    3.920747
              |
      age_old |
          L1. |    2.09911   1.306374     1.61   0.111    -.4878667    4.686087
              |
  age_veryold |
          L1. |   3.495814   1.398777     2.50   0.014     .7258538    6.265774
              |
 year_numeric |
          33  |   .0394621   .0282714     1.40   0.165    -.0165229    .0954472
          34  |   .0231069   .0320209     0.72   0.472    -.0403032    .0865169
          35  |  -.1419754   .0401082    -3.54   0.001    -.2214006   -.0625503
          36  |  -.1820866   .0463583    -3.93   0.000    -.2738886   -.0902846
          37  |  -.1482713   .0466809    -3.18   0.002    -.2407121   -.0558305
          38  |  -.1304147   .0523653    -2.49   0.014    -.2341122   -.0267172
          39  |  -.0905693   .0516393    -1.75   0.082    -.1928291    .0116905
          40  |  -.0372675    .053899    -0.69   0.491    -.1440021    .0694672
          41  |  -.0063264   .0558512    -0.11   0.910     -.116927    .1042741
              |
        _cons |  -.6348427   1.261483    -0.50   0.616    -3.132922    1.863237
--------------+----------------------------------------------------------------
      sigma_u |  .26052752
      sigma_e |  .18938797
          rho |   .6542609   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.lrgdpch2 L1.lpop L1.education L1.age_veryyoung L1.age_young L1.age_old L
> 1.age_veryold i.year_numeric if colony==0 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        177
Group variable: code_numeric                    Number of groups  =         23

R-sq:                                           Obs per group:
     within  = 0.3448                                         min =          5
     between = 0.3753                                         avg =        7.7
     overall = 0.2764                                         max =          8

                                                F(15,22)          =       8.03
corr(u_i, Xb)  = -0.9226                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 23 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   2.573117   1.428379     1.80   0.085     -.389161    5.535394
              |
     lrgdpch2 |
          L1. |   -.136333   .0849828    -1.60   0.123    -.3125764    .0399105
              |
         lpop |
          L1. |  -.5055512   .3561383    -1.42   0.170    -1.244137    .2330345
              |
    education |
          L1. |   .0097182   .0222632     0.44   0.667    -.0364528    .0558892
              |
age_veryyoung |
          L1. |     3.8977    1.73479     2.25   0.035     .2999659    7.495435
              |
    age_young |
          L1. |   1.773009   1.732062     1.02   0.317    -1.819068    5.365086
              |
      age_old |
          L1. |   3.550769   1.475694     2.41   0.025     .4903679     6.61117
              |
  age_veryold |
          L1. |   4.301504   2.623658     1.64   0.115     -1.13963    9.742637
              |
 year_numeric |
          35  |  -.0664563   .0646579    -1.03   0.315    -.2005485    .0676359
          36  |  -.0463266   .1236856    -0.37   0.712    -.3028348    .2101815
          37  |   .0344676    .158264     0.22   0.830     -.293752    .3626871
          38  |   .1110336   .1840535     0.60   0.552      -.27067    .4927371
          39  |   .2175342   .2133616     1.02   0.319    -.2249508    .6600192
          40  |   .2343118   .2558602     0.92   0.370    -.2963097    .7649334
          41  |   .2236785   .2760055     0.81   0.426    -.3487219    .7960788
              |
        _cons |   -9.02858   3.980235    -2.27   0.033    -17.28308   -.7740781
--------------+----------------------------------------------------------------
      sigma_u |   .6551863
      sigma_e |  .15722727
          rho |  .94554849   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. testparm L1.lpop L1.education 

 ( 1)  L.lpop = 0
 ( 2)  L.education = 0

       F(  2,    22) =    1.13
            Prob > F =    0.3416

. 
. xtreg fhpolrigaug L1.lrgdpch L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_numeric if c
> olony==0 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        254
Group variable: code_numeric                    Number of groups  =         43

R-sq:                                           Obs per group:
     within  = 0.2837                                         min =          1
     between = 0.6087                                         avg =        5.9
     overall = 0.6567                                         max =         10

                                                F(14,42)          =       3.75
corr(u_i, Xb)  = 0.0430                         Prob > F          =     0.0004

                           (Std. Err. adjusted for 43 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .2999735   .0867196     3.46   0.001     .1249663    .4749808
              |
age_veryyoung |
          L1. |   3.637522   1.351783     2.69   0.010     .9095131    6.365531
              |
    age_young |
          L1. |   2.426599   1.147167     2.12   0.040     .1115222    4.741675
              |
      age_old |
          L1. |   2.616939   1.529469     1.71   0.094    -.4696548    5.703534
              |
  age_veryold |
          L1. |   4.257475   2.273284     1.87   0.068     -.330197    8.845147
              |
 year_numeric |
          33  |   -.052786   .0311528    -1.69   0.098     -.115655    .0100829
          34  |  -.1444951   .0433899    -3.33   0.002    -.2320595   -.0569306
          35  |  -.2713576   .0496327    -5.47   0.000    -.3715204   -.1711948
          36  |  -.3316906   .0850607    -3.90   0.000      -.50335   -.1600313
          37  |  -.3221139   .0938516    -3.43   0.001    -.5115142   -.1327137
          38  |  -.2854744   .0814348    -3.51   0.001    -.4498165   -.1211323
          39  |  -.2251294   .0910209    -2.47   0.018     -.408817   -.0414418
          40  |  -.2529985   .1087319    -2.33   0.025    -.4724284   -.0335685
          41  |   -.227662   .1128714    -2.02   0.050    -.4554458    .0001218
              |
        _cons |  -4.237667   1.490208    -2.84   0.007    -7.245029   -1.230306
--------------+----------------------------------------------------------------
      sigma_u |  .20923142
      sigma_e |   .1594449
          rho |  .63262275   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. xtreg fhpolrigaug L1.lrgdpch L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_numeric if c
> olony==1 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        740
Group variable: code_numeric                    Number of groups  =         98

R-sq:                                           Obs per group:
     within  = 0.1434                                         min =          1
     between = 0.0443                                         avg =        7.6
     overall = 0.0074                                         max =         10

                                                F(14,97)          =       5.71
corr(u_i, Xb)  = -0.1801                        Prob > F          =     0.0000

                           (Std. Err. adjusted for 98 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |  -.0061039   .0411302    -0.15   0.882    -.0877359     .075528
              |
age_veryyoung |
          L1. |   1.361477   .8246232     1.65   0.102    -.2751715    2.998126
              |
    age_young |
          L1. |   1.834059   .9129637     2.01   0.047     .0220787    3.646039
              |
      age_old |
          L1. |  -.5272385   1.789999    -0.29   0.769    -4.079892    3.025415
              |
  age_veryold |
          L1. |   2.948062   1.713672     1.72   0.089    -.4531015    6.349226
              |
 year_numeric |
          33  |   .0882321   .0383964     2.30   0.024     .0120259    .1644383
          34  |   .0820917   .0388647     2.11   0.037     .0049561    .1592274
          35  |  -.1042181   .0485159    -2.15   0.034    -.2005087   -.0079275
          36  |  -.1500273   .0511018    -2.94   0.004    -.2514503   -.0486043
          37  |  -.1135515   .0511376    -2.22   0.029    -.2150456   -.0120575
          38  |  -.1026669   .0571832    -1.80   0.076    -.2161598    .0108259
          39  |  -.0626627   .0559272    -1.12   0.265    -.1736627    .0483373
          40  |   .0079701   .0566531     0.14   0.888    -.1044706    .1204108
          41  |   .0460121   .0576335     0.80   0.427    -.0683744    .1603985
              |
        _cons |  -.5599898   .7949883    -0.70   0.483    -2.137821    1.017842
--------------+----------------------------------------------------------------
      sigma_u |  .31702382
      sigma_e |   .1974348
          rho |  .72053905   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    97) =    1.75
            Prob > F =    0.1453

. 
. testparm i.year_numeric

 ( 1)  33.year_numeric = 0
 ( 2)  34.year_numeric = 0
 ( 3)  35.year_numeric = 0
 ( 4)  36.year_numeric = 0
 ( 5)  37.year_numeric = 0
 ( 6)  38.year_numeric = 0
 ( 7)  39.year_numeric = 0
 ( 8)  40.year_numeric = 0
 ( 9)  41.year_numeric = 0

       F(  9,    97) =    8.37
            Prob > F =    0.0000

. 
. xtreg fhpolrigaug L1.lrgdpch L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold i.year_numeric if c
> olony==0 ,fe cluster(code_numeric) 

Fixed-effects (within) regression               Number of obs     =        254
Group variable: code_numeric                    Number of groups  =         43

R-sq:                                           Obs per group:
     within  = 0.2837                                         min =          1
     between = 0.6087                                         avg =        5.9
     overall = 0.6567                                         max =         10

                                                F(14,42)          =       3.75
corr(u_i, Xb)  = 0.0430                         Prob > F          =     0.0004

                           (Std. Err. adjusted for 43 clusters in code_numeric)
-------------------------------------------------------------------------------
              |               Robust
  fhpolrigaug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      lrgdpch |
          L1. |   .2999735   .0867196     3.46   0.001     .1249663    .4749808
              |
age_veryyoung |
          L1. |   3.637522   1.351783     2.69   0.010     .9095131    6.365531
              |
    age_young |
          L1. |   2.426599   1.147167     2.12   0.040     .1115222    4.741675
              |
      age_old |
          L1. |   2.616939   1.529469     1.71   0.094    -.4696548    5.703534
              |
  age_veryold |
          L1. |   4.257475   2.273284     1.87   0.068     -.330197    8.845147
              |
 year_numeric |
          33  |   -.052786   .0311528    -1.69   0.098     -.115655    .0100829
          34  |  -.1444951   .0433899    -3.33   0.002    -.2320595   -.0569306
          35  |  -.2713576   .0496327    -5.47   0.000    -.3715204   -.1711948
          36  |  -.3316906   .0850607    -3.90   0.000      -.50335   -.1600313
          37  |  -.3221139   .0938516    -3.43   0.001    -.5115142   -.1327137
          38  |  -.2854744   .0814348    -3.51   0.001    -.4498165   -.1211323
          39  |  -.2251294   .0910209    -2.47   0.018     -.408817   -.0414418
          40  |  -.2529985   .1087319    -2.33   0.025    -.4724284   -.0335685
          41  |   -.227662   .1128714    -2.02   0.050    -.4554458    .0001218
              |
        _cons |  -4.237667   1.490208    -2.84   0.007    -7.245029   -1.230306
--------------+----------------------------------------------------------------
      sigma_u |  .20923142
      sigma_e |   .1594449
          rho |  .63262275   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. testparm i.year_numeric

 ( 1)  33.year_numeric = 0
 ( 2)  34.year_numeric = 0
 ( 3)  35.year_numeric = 0
 ( 4)  36.year_numeric = 0
 ( 5)  37.year_numeric = 0
 ( 6)  38.year_numeric = 0
 ( 7)  39.year_numeric = 0
 ( 8)  40.year_numeric = 0
 ( 9)  41.year_numeric = 0

       F(  9,    42) =    4.67
            Prob > F =    0.0003

. 
. testparm L1.age_veryyoung L1.age_young L1.age_old L1.age_veryold L1.age_midage

 ( 1)  L.age_veryyoung = 0
 ( 2)  L.age_young = 0
 ( 3)  L.age_old = 0
 ( 4)  L.age_veryold = 0

       F(  4,    42) =    1.99
            Prob > F =    0.1142

. 
. log close
      name:  <unnamed>
       log:  /Users/lizzieriese/Desktop/S21/ECO375/ECO375_A2.log
  log type:  text
 closed on:  22 Apr 2021, 23:49:46
----------------------------------------------------------------------------------------------------------
